\chapter{Ответы}
\label{ch:answers}

\openepigraph{%
Ставлю три звездочки. 
Я видал в детских книжках: 
когда человек делает прыжок к новой мысли, он ставит три звездочки...
}{Саша Чёрный, {Дневник Фокса Микки}
}

\newthought{Задачи рассеяны} по всей книге, а ответы на них собраны в этом разделе.

\begin{task}
    \label{answer:instance-in-OOP-vs-Wikidata}
    \newthought{Экземпляр объекта}\footnote[][0cm]{См. статью 
            \href{https://en.wikipedia.org/wiki/Instance\_(computer\_science)}{Instance (computer science)} в Английской Википедии.
            }
    в Викиданных 
    и в объектно-ориентированном программировании (ООП) сходны в сути, а именно:
    есть модель базового объекта $D$, создаётся новая единица $I$, обладающая 
    свойствами той же модели $D$. 
    В программировании говорят, что класс $D$ проинициализирован 
    и получен объект $I$\footnote[][0cm]{$I$ is instance of $D$}.

    В чём разница? 
    В ООП в исходном коде программы мы видим как во времени последовательно 
    (в разных строках программы) происходит 
    объявление переменной, инициализация класса, 
    присвоение значений экземплярам класса.
    В Викиданных в тот момент, когда выполняется скрипт и происходит обращение 
    к данным, объекты, являющиеся экземплярами других объектов, 
    уже представлены и обычно не происходит их изменение, 
    связанное с работой SPARQL-скриптов.

    \small{Вопрос на с.~\pageref{question:instance-in-OOP-vs-Wikidata}.}
\end{task}


\begin{task}
    \label{answer:guess_numbers_task}
    \newthought{В алгоритме угадывания чисел} число $ a $ может быть натуральным, целым, вещественным и рациональным числом, то есть $ a \in \mathbb{N},\mathbb{Z}, \mathbb{Q}, \mathbb{R} $, но кроме иррациональных чисел из-за конечности разрядной сетки компьютера. 
    \small{Вопрос на с.~\pageref{question:text}}
\end{task}

\begin{task}
    \label{answer:global-vars-pros-cons}
    \newthought{Ответ такой} ... todo. 

    \small{Вопрос на с.~\pageref{fig:block:proc:swap:colors}.}
\end{task}

%%%%%%%%%%%%%% City chapter %%%%%%%%%%%%%%
\begin{task}
    \label{answer:cities_geographic_objects}
    \newthought{В честь географических объектов} были названы Тула (\href{https://ru.wikipedia.org/wiki/Тулица}{река Тулица}), Курильск (\href{https://ru.wikipedia.org/wiki/Курильские_острова}{Курильские острова}) и Вологда (\href{https://ru.wikipedia.org/wiki/Вологда_(река)}{река Вологда}). Ответ на вопрос также можно получить, выполнив следующий SPARQL-запрос (листинг \ref{lst:cities_geographic_objects}). Значение свойства \href{https://www.wikidata.org/wiki/Property:P138}{named after} показывает, в честь какого объекта Викиданных был назван город.
    \begin{lstlisting}[ language=SPARQL, 
                    caption={\href{https://w.wiki/jiu}{Города, названные в честь географических объектов}},
                    label=lst:cities_geographic_objects, 
                    escapebegin=ку,escapeend=ку-ку>
                    ]
SELECT ?city ?cityLabel ?namedAfterLabel ?whatIsItLabel WHERE {
	?city wdt:P31/wdt:P279* wd:Q7930989.
	?city wdt:P138 ?namedAfter.
	?namedAfter wdt:P31 ?whatIsIt.
	FILTER(?city = wd:Q1341 || ?city = wd:Q2770 || ?city = wd:Q5655 ||
		?city = wd:Q156046 || ?city = wd:Q1957 || ?city = wd:Q175651)
	SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
}
    \end{lstlisting}
    \small{Вопрос на с.~\pageref{lst:population_town}.}
\end{task}

\begin{task}
    \label{answer:cities_over_400_age}
    \newthought{Более 400 лет назад} были основаны Москва (1147 г.), Воронеж (1586 г.), Самара (1586 г.), Казань (1005 г.) и Астрахань (1558 г.). Ответ на вопрос также можно получить, выполнив следующий SPARQL-запрос (листинг \ref{lst:cities_over_400_age}). Значение свойства \href{https://www.wikidata.org/wiki/Property:P571}{inception} содержит дату основания города.
    \begin{lstlisting}[ language=SPARQL, 
                    caption={\href{https://w.wiki/jnv}{Города, основанные более 400 лет назад}},
                    label=lst:cities_over_400_age, 
                    escapebegin=ку,escapeend=ку-ку>
                    ]
SELECT ?city ?cityLabel ?inceptionDate WHERE {
	?city wdt:P31/wdt:P279* wd:Q7930989.
	?city wdt:P17 wd:Q159.
	?city wdt:P571 ?inceptionDate.
	FILTER(BOUND(?inceptionDate) && 
					DATATYPE(?inceptionDate) = xsd:dateTime).
	BIND(NOW() - ?inceptionDate AS ?distance).
	FILTER(0 <= ?distance && ?distance > 146000). # = 400 * 365
	FILTER(?city = wd:Q649 || ?city = wd:Q193522 || ?city = wd:Q900 ||
		?city = wd:Q3927 || ?city = wd:Q894 || ?city = wd:Q3426)
	SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
}
GROUP BY ?city ?cityLabel ?inceptionDate    
\end{lstlisting}

    \small{Вопрос на с.~\pageref{fig:city_relation_Russia_S_N}.}
\end{task}

\begin{task}
    \label{answer:cities_flags}
    \newthought{Флаг, изображенный на рис. \ref{fig:flag_question_city}} принадлежит городу \href{https://ru.wikipedia.org/wiki/Карабулак_(город)}{Карабулак}. Ответ на вопрос также можно получить, выполнив следующий SPARQL-запрос (листинг \ref{lst:cities_flags}). Значение свойства \href{https://www.wikidata.org/wiki/Property:P41}{flag image} содержит изображение флага города.
    
    \begin{lstlisting}[ language=SPARQL, 
                    caption={\href{https://w.wiki/kBM}{Флаги городов}},
                    label=lst:cities_flags, 
                    escapebegin=ку,escapeend=ку-ку>
                    ]
#defaultView:ImageGrid
SELECT ?city ?cityLabel ?flag ?countryLabel WHERE {
	?city wdt:P31/wdt:P279* wd:Q7930989.
	?city wdt:P17 ?country.
	?city wdt:P41 ?flag.
	FILTER(?city = wd:Q144969)
	SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
}
\end{lstlisting}
    
    \small{Вопрос на с.~\pageref{lst:example_union_city}.}
\end{task}

%%%%%%%%%%%%%% Aircraft chapter %%%%%%%%%%%%%%

\begin{task}
    \label{answer:aircraft_manufacturers}
    \newthought{Веб-сайты есть у следующих Российских производителей: Миг, Туполев и Сухой. Ответ на вопрос также можно получить, выполнив следующий SPARQL-запрос (листинг \ref{lst:aircraft_manufactures_lst})}. 
    
	\begin{lstlisting}[ language=SPARQL, caption={{Веб-сайты производителей}\protect\footnotemark}, label=lst:aircraft_manufactures_lst, ]
SELECT ?item ?itemLabel ?site
WHERE
{
    ?item wdt:P31 wd:Q936518. # instance of aerospace manufacturer
  	?item wdt:P17 wd:Q159. # country Russia
  	?item wdt:P856 ?site # official website
    SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
}
\end{lstlisting}
\footnotetext{Ссылка на SPARQL-запрос: \href{https://w.wiki/kXg}{https://w.wiki/kXg} }
    
    \small{Вопрос на с.~\pageref{lst:lang2}.}
\end{task}

\begin{task}
    \label{answer:aircraft_company_foundation_date}
    \newthought{Компания <<Миг>> была основана 18 декабря 1939 г., <<Вымпел>> - 18 ноября 1949 г., <<Туполев>> - 01 января 1922 г., <<Сухой>> - 01 января 1939 г. Ответ на вопрос также можно получить, выполнив следующий SPARQL-запрос (листинг \ref{lst:aircraft_company_foundation_date_lst})}. 
    
	\begin{lstlisting}[ language=SPARQL, caption={{Даты основания компаний}\protect\footnotemark}, label=lst:aircraft_company_foundation_date_lst, ]
SELECT ?item ?itemLabel ?inception
WHERE
{
    ?item wdt:P31 wd:Q936518. # instance of aerospace manufacturer
  	?item wdt:P17 wd:Q159. # country Russia
  	?item wdt:P571 ?inception # foundation date
    SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
}
\end{lstlisting}
\footnotetext{Ссылка на SPARQL-запрос: \href{https://w.wiki/kXu}{https://w.wiki/kXu} }
    
    \small{Вопрос на с.~\pageref{aircraft_question_2}.}
\end{task}

\begin{task}
    \label{answer:aircraft_company_headquarters}
    \newthought{Штаб-квартира компании <<Камов>> находится в городе Люберцы, <<Авиадвигатель>> - г. Пермь, <<Улан-Удэнский авиационный завод>> - г. Улан-Удэ, <<Сухой>> - г. Москва. Ответ на вопрос также можно получить, выполнив следующий SPARQL-запрос (листинг \ref{lst:aircraft_company_headquarters_lst})}. 
    
	\begin{lstlisting}[ language=SPARQL, caption={{Штаб-квартиры компаний}\protect\footnotemark}, label=lst:aircraft_company_headquarters_lst, ]
SELECT ?item ?itemLabel ?inceptionLabel
WHERE
{
    ?item wdt:P31 wd:Q936518. # instance of aerospace manufacturer
  	?item wdt:P17 wd:Q159. # country Russia
  	?item wdt:P159 ?inception # headquarters location
    SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
}
\end{lstlisting}
\footnotetext{Ссылка на SPARQL-запрос: \href{https://w.wiki/kY9}{https://w.wiki/kY9} }
    
    \small{Вопрос на с.~\pageref{aircraft_question_3}.}
\end{task}

\begin{task}
    \label{answer:aircraft_question_airship}
    \newthought{Дирижабль}. 
    
    \small{Вопрос на с.~\pageref{aircraft_question_4}.}
\end{task}

\begin{task}
    \label{answer:aircraft_question_airship_2}
    \newthought{Воздушное судно изображенное на рис. \ref{fig:airship_question_aircraft} это дирижабль. Ответ на вопрос также можно получить, выполнив следующий SPARQL-запрос (листинг \ref{lst:aircraft_airship_photo_lst})}. 
    
	\begin{lstlisting}[ language=SPARQL, caption={{Изображения дирижаблей}\protect\footnotemark}, label=lst:aircraft_airship_photo_lst, ]
#defaultView:ImageGrid
SELECT ?item ?itemLabel ?image
WHERE
{
    ?item wdt:P31 wd:Q133585. # instance of airship
  	?item wdt:P18 ?image # image airship
    SERVICE wikibase:label { bd:serviceParam wikibase:language "en" }
}
\end{lstlisting}
\footnotetext{Ссылка на SPARQL-запрос: \href{https://w.wiki/kY6}{https://w.wiki/kY6} }
    
    \small{Вопрос на с.~\pageref{aircraft_question_5}.}
\end{task}

\begin{task}
    \label{answer:prog_langs_1}
    \newthought{Язык программирования Ада был разработан Jean Ichbiah, Форт разработал Charles H. Moore, а создателем языка Erlang считается Joe Armstrong. Ответ на вопрос также можно получить, выполнив следующий SPARQL-запрос (листинг \ref{lst:prog_lang_answer_1})}. 
	\begin{lstlisting}[language=SPARQL, caption={{Создатели языков программирования}\protect\footnotemark}, label=lst:prog_lang_answer_1]
		SELECT ?item_label ?developer_label
		WHERE
		{
		 ?item wdt:P31 wd:Q9143
		 ; rdfs:label ?item_label. 
		 ?item wdt:P178 ?developer.
		 ?developer rdfs:label ?developer_label.
		 
		 FILTER (LANG(?item_label) = "en"). 
		 FILTER (LANG(?developer_label) = "en"). 
		}
		ORDER BY DESC (?item_label)
	\end{lstlisting}
\footnotetext{Ссылка на SPARQL-запрос: \href{https://w.wiki/kfZ}{https://w.wiki/kfZ} }
    
    \small{Вопрос на с.~\pageref{prog_lang_questions}.}
\end{task}

\begin{task}
    \label{answer:prog_langs_2}
    \newthought{Логотипом языка программирования LOLCODE является третья картинка. Ответ на вопрос также можно получить, выполнив следующий SPARQL-запрос (листинг \ref{lst:prog_lang_answer_1})}. 
	\begin{lstlisting}[language=SPARQL, caption={{Логотипы языков программирования}\protect\footnotemark}, label=lst:prog_lang_answer_1]
		#defaultView:ImageGrid
		SELECT ?item_label ?image
		WHERE
		{
		 ?item wdt:P31 wd:Q9143 # instances of programming language
		 ; rdfs:label ?item_label. 
		 ?item wdt:P154 ?image. # image
		 	
		 	FILTER (lang(?item_label) = "en")
}
	\end{lstlisting}
\footnotetext{Ссылка на SPARQL-запрос: \href{https://w.wiki/kfd}{https://w.wiki/kfd} }
    
    \small{Вопрос на с.~\pageref{prog_lang_questions}.}
\end{task}

\begin{task}
    \label{answer:prog_langs_3}
    \newthought{Считается, что Фортран имеет от 8 до 12 диалектов, Лисп - 6 диалектов, а Standart ML и Object Pascal по 3 диалекта.}
    \small{Вопрос на с.~\pageref{prog_lang_questions}}.
\end{task}

\begin{task}
    \label{answer:prog_langs_4}
    \newthought{Получить список языков программирования со свойством \href{https://www.wikidata.org/wiki/Property:P822}{"персонаж-талисман"} можно выполнив следующий SPARQL-запрос (листинг \ref{lst:prog_lang_answer_4})}. 
	\begin{lstlisting}[language=SPARQL, caption={{"Персонажи-талисманы" языков программирования}\protect\footnotemark}, label=lst:prog_lang_answer_4]
		#Select programming languages with mascot
		SELECT DISTINCT ?lang_name ?mascot_name
		WHERE
		{
		    ?lang wdt:P31 wd:Q9143 .
		    ?lang wdt:P822 ?mascot .
		    ?lang rdfs:label ?lang_name filter (lang(?lang_name) = "en").
		    ?mascot rdfs:label ?mascot_name filter (lang(?mascot_name) = "en").
		}
	\end{lstlisting}
\footnotetext{Ссылка на SPARQL-запрос: \href{https://w.wiki/kfj}{https://w.wiki/kfj} }
    
    \small{Вопрос на с.~\pageref{prog_lang_questions}.}
\end{task}

\begin{task}
    \label{answer:prog_langs_5}
    \newthought{Получить список языков программирования, основанных ранее 1992 года можно выполнив следующий SPARQL-запрос (листинг \ref{lst:prog_lang_answer_5})}. 
	\begin{lstlisting}[language=SPARQL, caption={{Языки программирования, старше 1992 года}\protect\footnotemark}, label=lst:prog_lang_answer_5]
		#Select langeages older than 1992
		SELECT DISTINCT ?lang_name ?age
		WHERE
		{
		    ?lang wdt:P31 wd:Q9143 .
		    ?lang wdt:P571 ?age .
		    ?lang rdfs:label ?lang_name filter (lang(?lang_name) = "en").
		    FILTER(year(?age) < 1992)
		}
	\end{lstlisting}
\footnotetext{Ссылка на SPARQL-запрос: \href{https://w.wiki/kfn}{https://w.wiki/kfn} }
    
    \small{Вопрос на с.~\pageref{prog_lang_questions}.}
\end{task}

\begin{task}
    \label{answer:prog_langs_6}
    \newthought{Построить столбчатую диаграмму, отражающую количество известных хештегов в Твиттере для каждого языка программирования можно выполнив следующий SPARQL-запрос (листинг \ref{lst:prog_lang_answer_6})}. 
	\begin{lstlisting}[language=SPARQL, caption={{Хештеги языков программирования в Твиттере}\protect\footnotemark}, label=lst:prog_lang_answer_6]
		#defaultView:BarChart
		#Twitter tags for programming language
		SELECT DISTINCT ?lang_name (count(*) as ?count)
		WHERE
		{
		    ?lang wdt:P31 wd:Q9143 .
		    ?lang wdt:P2572 ?count .
		    ?lang rdfs:label ?lang_name filter (lang(?lang_name) = "en"). 
		} 
		GROUP BY ?lang_name 
		ORDER BY DESC(?count)
	\end{lstlisting}
\footnotetext{Ссылка на SPARQL-запрос: \href{https://w.wiki/kfo}{https://w.wiki/kfo} }
    
    \small{Вопрос на с.~\pageref{prog_lang_questions}.}
\end{task}




