% Remove number from chapter
\makeatletter
\titleformat{\chapter}%
  [display]% shape
  {\relax\ifthenelse{\NOT\boolean{@tufte@symmetric}}{\begin{fullwidth}}{}}% format applied to label+text
%  {\itshape\huge\thechapter}% label
  {}% label
  {0pt}% horizontal separation between label and title body
  {\huge\rmfamily\itshape}%\thechapter. }% before the title body
  [\ifthenelse{\NOT\boolean{@tufte@symmetric}}{\end{fullwidth}}{}]% after the title body
\makeatother


\chapter*{Ответы}
\markboth{Ответы}{} % remove "Chapter" numbering in headline (top right)
\label{ch:answers}
\addcontentsline{toc}{chapter}{Ответы}

%\TODO uncomment
%\epigraph{%
%Ставлю три звездочки. 
%Я видал в детских книжках: 
%когда человек делает прыжок к новой мысли, 
%он~ставит три звездочки\ldots%
%}{%
%Саша Чёрный. Дневник Фокса Микки}


В каждой из глав на полях даются задания, а ответы на них собраны здесь.
\marginnote[-3\baselineskip]{
    \MarginQuestion
    Таким значком-лампочкой отмечены на полях вопросы. 
    Не~на~все из~них, но~на~большинство~--- ответы представлены ниже.
}

\begin{task}
    \label{answer:instance-in-OOP-vs-Wikidata}
    Экземпляр объекта\footnote[][0cm]{%
        См. статью 
        \href{https://en.wikipedia.org/wiki/Instance\_(computer\_science)}{Instance (computer science)} в Английской Википедии.
%
    } в Викиданных 
    и в объектно-ориентированном программировании (ООП) сходны в сути, а именно:
    есть модель базового объекта $D$, создаётся новая единица $I$, обладающая 
    свойствами той же модели $D$. 
    В программировании о создании $I$ говорят, 
    что класс $D$ проинициализирован 
    и получен объект $I$\footnote[][0cm]{%
        $I$~является экземпляром $D$ или 
        \mbox{$I$~is instance of $D$} по-английски.}. 
%        $I$~is instance of $D$ по-английски, 
%        $I$~является экземпляром $D$ \mbox{по-русски}}.

    В чём разница? 
    В ООП в исходном коде программы мы видим, как во времени последовательно 
    (в разных строках программы) происходит 
    объявление переменной, инициализация класса, 
    присвоение значений экземплярам класса.
    В Викиданных в тот момент, когда выполняется скрипт и происходит обращение 
    к данным, объекты, являющиеся экземплярами других объектов, 
    уже представлены и обычно не происходит их изменение, 
    связанное с~работой SPARQL-скриптов.

    \small{\AnswerBackref Вопрос на с.~\pageref{question:instance-in-OOP-vs-Wikidata}.}
\end{task}



%%%%%%%%%%%%%% Aircraft chapter %%%%%%%%%%%%%%
\marginnote[1\baselineskip]{
    Таким орнаментом мы разделим ответы на вопросы из разных глав.%
}
\hfil\pgfornament[width=4cm]{80}\hfil%



\newpage
\begin{task}
    \label{answer:aircraft_manufacturers}
    Веб-сайты есть у следующих российских производителей: 
    Миг, Туполев и Сухой. 
    Эти сайты можно получить с помощью запроса~\ref{lst:aircraft_manufactures_lst}. 

\begin{lstlisting}[ 
            language=SPARQL, 
            caption={\href{https://w.wiki/t4H}{Веб-сайты российских авиазаводов}\protect\footnotemark}, 
            label=lst:aircraft_manufactures_lst, 
            numbers=none,
            ]
SELECT ?manufacturer ?manufacturerLabel ?site WHERE
{
  ?manufacturer wdt:P31 wd:Q936518. # instance of aerospace manufacturer
  ?manufacturer wdt:P17 wd:Q159. # country Russia
  ?manufacturer wdt:P856 ?site # official website
  SERVICE wikibase:label {bd:serviceParam wikibase:language "ru"}
}
\end{lstlisting}
\footnotetext{Получено: 14 авиазаводов в России с веб-сайтами на 2020 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/t4H}{https://w.wiki/t4H}.}
    
    \small{\AnswerBackref Вопрос на с.~\pageref{lst:lang2}.}
\end{task}

\begin{task}
    \label{answer:aircraft_company_foundation_date}
    \newthought{Компания 
<<Туполев>> была основана в 1922 году, 
<<МиГ>> и <<Сухой>>~--- в 1939-м, 
<<Вымпел>>~--- в 1949 году.
    Ответ на вопрос можно получить, выполнив запрос~\ref{lst:aircraft_company_foundation_date_lst}}. 
    
	\begin{lstlisting}[ 
            language=SPARQL, 
            caption={\href{https://w.wiki/vaH}{Даты основания отечественных авиазаводов}\protect\footnotemark}, 
            label=lst:aircraft_company_foundation_date_lst, 
            numbers=none,
            ]
# Russian aircraft factories sorted by inception years
SELECT ?manufacturer ?manufacturerLabel (YEAR(?inception) AS ?year) WHERE 
{
  ?manufacturer wdt:P31 wd:Q936518;  # is aerospace manufacturer
                wdt:P17 wd:Q159;     # country Russia
                wdt:P571 ?inception. # foundation date
  SERVICE wikibase:label {bd:serviceParam wikibase:language "ru"}
}
ORDER BY ?year
\end{lstlisting}
\footnotetext{Получено: 15 отечественных авиазаводов с датой основания на 2021 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/vaH}{https://w.wiki/vaH}.}
    
    \small{\AnswerBackref Вопрос на с.~\pageref{aircraft_question_2}.}
\end{task}

\begin{task}
    \label{answer:aircraft_company_headquarters}
Штаб-квартира компании <<Камов>> находится в городе Люберцы, 
    <<Авиадвигатель>>~--- в~Перми, 
    <<Улан-Удэнский авиационный завод>>~--- в городе Улан-Удэ, 
    <<Сухой>>~--- в Москве. 
    Ответ на вопрос можно получить, выполнив запрос~\ref{lst:aircraft_company_headquarters_lst}. 
   

\newpage
\begin{lstlisting}[ 
            language=SPARQL, 
            caption={\href{https://w.wiki/t4X}{Штаб-квартиры компаний}\protect\footnotemark}, 
            label=lst:aircraft_company_headquarters_lst, 
            numbers=none,
                    ]
SELECT ?manufacturer ?manufacturerLabel ?inceptionLabel WHERE
{
    ?manufacturer wdt:P31 wd:Q936518. # instance of aerospace manufacturer
  	?manufacturer wdt:P17 wd:Q159. # country Russia
  	?manufacturer wdt:P159 ?inception # headquarters location
    SERVICE wikibase:label {bd:serviceParam wikibase:language "ru"}
}
\end{lstlisting}
\footnotetext{Получено: 16 российских авиазаводов, имеющих штаб-квартиры на~2021~год. Ссылка на SPARQL-запрос: \href{https://w.wiki/t4X}{https://w.wiki/t4X}.}
    
    \small{\AnswerBackref Вопрос на с.~\pageref{aircraft_question_3}.}
\end{task}


\begin{task}
    \label{answer:aircraft_question_airship}
Воздушным судном, удерживаемым в воздухе огромным баллоном 
    с горючим и смертельно опасным газом, 
    расположенным прямо над головами пассажиров, является дирижабль. 
    
    \small{\AnswerBackref Вопрос на с.~\pageref{aircraft_question_4}.}
\end{task}



% Unknown old Soviet airship on black and white photo
%
\begin{task}
    \label{answer:aircraft_question_airship_2}
Воздушное судно, 
    изображенное на~с.~\pageref{fig:airship_question_aircraft},~--- 
    это дирижабль \ruwiki{wKY}{СССР--В6 <<Осоавиахим>>} (1934--1938), 
    который установил мировой рекорд в~1937 году, 
    пролетев 130 с~половиной часов без посадки.
    Для построения <<плиточки>> (ImageGrid) из иллюстраций дирижаблей 
    выполните запрос~\ref{lst:aircraft_airship_photo_lst}.
    
	\begin{lstlisting}[ 
            language=SPARQL, 
            caption={\href{https://w.wiki/t4c}{Изображения дирижаблей}\protect\footnotemark}, 
            label=lst:aircraft_airship_photo_lst, 
            numbers=none,
                    ]
#defaultView:ImageGrid
SELECT ?airship ?airshipLabel ?image WHERE
{
    ?airship wdt:P31 wd:Q133585. # instance of airship
  	?airship wdt:P18 ?image # image airship
    SERVICE wikibase:label {bd:serviceParam wikibase:language "ru"}
}
\end{lstlisting}
\footnotetext{Получено: 18 дирижаблей с иллюстрациями в~2021~году. Ссылка на~SPARQL-запрос: \href{https://w.wiki/t4c}{https://w.wiki/t4c}.}
    
\small{\AnswerBackref Вопрос на с.~\pageref{fig:airship_question_aircraft}.}
\end{task}
%eo Aircraft chapter %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%



%%%%%%%%%%%%%% Anime charpter %%%%%%%%%%%%%%
%eo Anime chapter %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%




\hfil\pgfornament[width=4cm]{80}\hfil%
\newpage
%%%%%%%%%%%%%%% Human_settlements charpter %%%%%%%%%%

\begin{task}
\label{answer:human_settlements_density}
    Плотность населения в Алейске составляет 648 чел./км\textsuperscript{2}, 
        в~Барабинске~--- 413 чел./км\textsuperscript{2}, 
        то есть в Алейске плотность выше. 

        Плотность населения по населённым пунктам России можно получить 
        с помощью запроса~\ref{lst:human_settlements_density}. 

        Обратите внимание, что площадь может быть задана в разных единицах. 
        Например, у~\wdqName{Алейска}{11304591} площадь в Викиданных указана в гектарах, 
        у~\wdqName{Барабинска}{104609}~--- в квадратных километрах. 
        Для нормализации данных и перевода площади в~метры в~строке~8 запроса~\ref{lst:human_settlements_density}
        указан префикс \lstinline|psn:|. 

        В~строке~2 делим \lstinline|?area| на миллион, чтобы перевести квадратные метры в километры. 
        Результат деления записываем в~переменную \lstinline|?popArea|, которая показывает плотность населения. 


\index{SPARQL!psn:!Нормализация площади населённого пункта}
\begin{lstlisting}[ language=SPARQL, 
                    caption={\href{https://w.wiki/6ibN}{Плотность населения <<населенных пунктов>> России}\protect\footnotemark},
                    label=lst:human_settlements_density,
                    xleftmargin=18pt, 
                  ]
# population density of human settlements in Russia
SELECT ?hum ?humLabel ?population ?area (?population / (?area / 1000000) as ?popArea) 
WHERE {
    ?hum wdt:P31 wd:Q486972; # is human settlement
         wdt:P17 wd:Q159;    # in Russia
       
    # The psn: prefix normalizes the values to a common unit of area
    p:P2046/psn:P2046/wikibase:quantityAmount ?area;  # get the area
       
    wdt:P1082 ?population. # has ?population
    FILTER(?population>0 && ?area).
    SERVICE wikibase:label{bd:serviceParam wikibase:language "ru,en"}
}
ORDER BY DESC (?popArea)
\end{lstlisting}
\footnotetext{Получено: 131 населённый пункт в~России с~известной плотностью населения на~2021 год, 
                        152~--- на~2023 год. 
              SPARQL-запрос: \href{https://w.wiki/6ibN}{https://w.wiki/6ibN}.}

    \small{\AnswerBackref Вопрос на с.~\pageref{ch:human-settlement}.}
\end{task}



\begin{task}
\label{answer:flag_human_settlements}
Гербы, изображенные на с.~\pageref{fig:flag_question_human_settlements1}, 
    с.~\pageref{fig:flag_question_human_settlements2} и 
    с.~\pageref{fig:flag_question_human_settlements5}, 
    являются гербами отечественных населённых пунктов. 
    Герб~на~с.~\pageref{fig:flag_question_human_settlements3} 
    принадлежит \ruwiki{4dUc}{чешскому} населённому пункту, 
    герб~на~рис.~\pageref{fig:flag_question_human_settlements4}~--- 
    \ruwiki{4dUf}{украинскому}. 

Ответ можно получить с помощью запроса~\ref{lst:flag_question_human_settlements}. 
    Значение свойства \wdProperty{94}{coat of arms image} 
    содержит изображение герба населённого пункта.
   
\index{График!ImageGrid!Гербы населённых пунктов России}
\begin{lstlisting}[ language=SPARQL, 
                    caption={\href{https://w.wiki/4e8A}{Гербы населённых пунктов Российской Федерации}\protect\footnotemark},
                    label=lst:flag_question_human_settlements,
                    numbers=none,
                  ]
# Emblems of human settlements in Russia
#defaultView:ImageGrid
SELECT ?hum ?humLabel ?image WHERE {
  ?hum wdt:P31 wd:Q486972; # instance of human settlement
       wdt:P17 wd:Q159;    # in Russia
       wdt:P94 ?image.     # coat of arms
  SERVICE wikibase:label{bd:serviceParam wikibase:language "ru, en"}
}
\end{lstlisting}

\footnotetext{Получено: 148 гербов на 2022 год. SPARQL-запрос: \href{https://w.wiki/4e8A}{https://w.wiki/4e8A}.}
\small{Вопросы на с.~\pageref{fig:flag_question_human_settlements1}, \pageref{fig:flag_question_human_settlements2}, \pageref{fig:flag_question_human_settlements3}, \pageref{fig:flag_question_human_settlements4}, \pageref{fig:flag_question_human_settlements5}.}
\end{task}
% eo Human_settlements charpter %%%%%%%%%%%%%%%%%%%%%%




\hfil\pgfornament[width=4cm]{80}\hfil%
\newpage
%%%%%%%%%%%%%% City chapter %%%%%%%%%%%%%%

\begin{task}
    \label{answer:cities_geographic_objects}
    В честь географических объектов были названы 
    Тула (\href{https://w.wiki/oLJ}{река Тулица}), 
    Курильск (\href{https://w.wiki/oLH}{Курильские острова}) 
    и Вологда (\href{https://w.wiki/oLG}{река Вологда}). 
    Ответ на вопрос можно получить, выполнив запрос~\ref{lst:cities_geographic_objects}. 
    Значение свойства \wdProperty{138}{named after} 
    показывает, в честь какого объекта Викиданных был назван город.
   
\index{SPARQL!FILTER!Города, названные в честь географических объектов}
\begin{lstlisting}[ language=SPARQL, 
                    caption={\href{https://w.wiki/6icv}{Города, названные в честь географических объектов}\protect\footnotemark},
                    label=lst:cities_geographic_objects,
                    xleftmargin=18pt, 
                    ]
SELECT DISTINCT ?city ?cityLabel ?namedAfter ?namedAfterLabel 
WHERE {
  ?city wdt:P31/wdt:P279* wd:Q7930989. # instances/subclasses of "city/town" 
  ?city wdt:P138 ?namedAfter. # with filled property "named after"
  FILTER(?city = wd:Q1341 || ?city = wd:Q156046 ||
         ?city = wd:Q2770 || ?city = wd:Q1957 ||
         ?city = wd:Q5655 || ?city = wd:Q175651)
  SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
}
\end{lstlisting}%
\marginnote[-4.4cm]{В строке 3 запроса~\ref{lst:cities_geographic_objects} 
    после конструкции \lstinline|wdt:P31/wdt:P279*| следует объект Викиданных, 
    объединяющий \wdqName{city}{515} и \wdqName{town}{3957} 
    и называющийся \wdqName{city/town}{7930989}. 
    Такой поиск с помощью подклассов позволяет найти экземпляры сразу обоих типов городов. 
    Подробности см. в~главе~<<\nameref{sect:city-completness}>>, 
    в~тексте, предшествующем запросу~\ref{lst:example_subclasses_city} на~с.~\pageref{lst:example_subclasses_city}.
    }
\footnotetext{Для 6 городов, заданных в строках 5--7, 
              получено 6 объектов, в честь которых названы города. 
              Из них 3 города названы в честь географических объектов (см.~выше), 
              2~--- в честь известных людей и 
              один город~--- в честь железнодорожной станции. 
              Ссылка на SPARQL-запрос: \href{https://w.wiki/6icv}{https://w.wiki/6icv}.}

    \small{\AnswerBackref Вопрос на с.~\pageref{lst:population_town}.}
\end{task}



\begin{task}
    \label{answer:cities_over_400_age}
    Более 400 лет назад были основаны Казань (1005 год), Москва (1147), 
    Астрахань (1558), Воронеж (1586) и Самара (1586). 
    Самым молодым городом оказался Саров, основанный в~1691 году. 
    Ответ на вопрос можно получить, выполнив запрос~\ref{lst:cities_over_400_age}. 

    
    \index{SPARQL!FILTER!Дата основания городов}
    \index{SPARQL!YEAR!Дата основания городов}
    \begin{lstlisting}[ language=SPARQL, 
                    caption={\href{https://w.wiki/6idC}{Города, основанные более 400 лет назад в России}\protect\footnotemark},
                    label=lst:cities_over_400_age,
                    xleftmargin=18pt, 
                    ]
SELECT ?city ?cityLabel (YEAR(?inceptionDate) AS ?year) 
WHERE {
	?city wdt:P31/wdt:P279* wd:Q7930989. # instances of "city/town" subclasses
    ?city wdt:P17 wd:Q159.               # in Russia
	?city wdt:P571 ?inceptionDate.       # with filled property "inception"  
    FILTER (YEAR(?inceptionDate) < 1620). # 2020 - 400 years
    FILTER(?city = wd:Q649 || ?city = wd:Q193522 || ?city = wd:Q900 ||
           ?city = wd:Q3927 || ?city = wd:Q894 || ?city = wd:Q3426)
  	SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
}
GROUP BY ?city ?cityLabel ?inceptionDate
ORDER BY ASC(?year)
\end{lstlisting}
\footnotetext{Из 6 городов, заданных в строках 7--8, 
              получено 4 города в России, основанные до 1620 года. 
              Ссылка на SPARQL-запрос: \href{https://w.wiki/6idC}{https://w.wiki/6idC}.%
} 

Подумайте, какие строки в~запросе~\ref{lst:cities_over_400_age} нужно закомментировать, 
    чтобы получить, во-первых, список всех отечественных городов, 
    во-вторых, 
    список городов всего мира, основанных более 400 лет назад? 

Как вы думаете, может ли в запросе~\ref{lst:cities_over_400_age} 
    переменная \lstinline|?year| принимать отрицательные значения? 
    Если <<да>>, то почему?


    Значение свойства 
    \wdProperty{571}{inception} 
    содержит дату основания города.
У объекта Викиданных \wdqName{Москва}{649} 
    свойство inception 
    принимает значение unknown value (неизвестное значение) 
    с квалификатором <<самое позднее упоминание>> 
    (\wdProperty{1326}{latest date}), равным 4~апреля 1147 года. 
    Вероятно, по этой причине в~запросе~\ref{lst:cities_over_400_age} 
    переменная \lstinline|?year| принимает для~Москвы пустое значение, 
    и Москва ошибочно не попадает в список правильных ответов. 
    Таким образом, чтобы извлечь 1147 год, 
    необходимо доработать имеющийся скрипт, что мы и предоставим читателю. 

\marginnote[-1.0cm]{%
О типах данных и наборах свойств, связанных с датой и временем, 
    см.~справку на~странице Викиданных \href{https://w.wiki/NdT}{Help:Dates}.
}

    \small{\AnswerBackref Вопрос на с.~\pageref{fig:city_relation_Russia_S_N}.}
\end{task}


\begin{task}
    \label{answer:cities_flags}
    Флаг, изображенный на рисунке, 
    принадлежит городу \href{https://w.wiki/oLF}{Карабулак}. 
    Ответ на вопрос можно получить с помощью запроса~\ref{lst:cities_flags}. 
    Значение свойства \wdProperty{41}{flag image} 
    содержит изображение флага города.
    
    \index{SPARQL!FILTER!Флаги городов}
    \begin{lstlisting}[ language=SPARQL, 
                    caption={\href{https://w.wiki/t5q}{Флаги городов в России}\protect\footnotemark},
                    label=lst:cities_flags,
                    numbers=none,
                    ]
#defaultView:ImageGrid
SELECT ?city ?cityLabel ?flag ?countryLabel WHERE {
    ?city wdt:P31/wdt:P279* wd:Q7930989; # instances/subclasses of "city/town"
          wdt:P17 wd:Q159;               # in Russia
          wdt:P41 ?flag.                 # with filled property "flag"
    SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
}
\end{lstlisting}
\footnotetext{Получено: 980 городов России имеют флаги на 2023 год. 
              Ссылка на~SPARQL-запрос: \href{https://w.wiki/t5q}{https://w.wiki/t5q}.}
    
    \small{\AnswerBackref Вопрос на с.~\pageref{lst:countries_sister_cities_with_Russia}.}
\end{task}




\hfil\pgfornament[width=4cm]{80}\hfil%
\newpage
%%%%%%%%%%%%%% Country chapter %%%%%%%%%%%%%%
\begin{task}
	\label{answer:administrative_territorial}
Речь идёт о количестве 
административно-территориальных единиц в~каждой из~стран. 
		%Количество административно-территориальных единиц у \href{https://w.wiki/mzN}{Латвии}  119, у \href{https://w.wiki/mzP}{Таиланда} 77, у \href{https://w.wiki/mzR}{Дании} 5, а у \href{https://w.wiki/myt}{России} 81. 
Количество административно-территориальных единиц по~странам 
    можно получить с~помощью запроса~\ref{lst:administrative_territorial_entity}.
	
\begin{lstlisting}[ language=SPARQL, 
	caption={\href{https://w.wiki/tiN}{
	Список стран, упорядоченных по количеству административно-территориальных единиц}\protect\footnotemark},
	label=lst:administrative_territorial_entity,
    numbers=none,
    ]
# Countries sorted by number of administrative territories
SELECT ?country ?countryLabel  (count(*) as ?count) WHERE
{
    ?country p:P31 [ps:P31 wd:Q6256].# is a country
    ?country wdt:P150 []. # has some administrative territory
    SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
}
GROUP BY ?country ?countryLabel
ORDER BY DESC(?count)
\end{lstlisting}
\footnotetext{Получено: 199 стран на 2021 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/tiN}{https://w.wiki/tiN}.}
	
\small{\AnswerBackref Вопрос на с.~\pageref{lst:age_of_country}.}
\end{task}



\begin{task}
	\label{answer:old_countries}
Результатом выполнения запроса~\ref{lst:old_countries} будет список империй и небольших стран, 
    исчезнувших с лица земли. 
    Две с половиной тысячи лет и больше просуществовали только семь государств: 
    \href{https://w.wiki/vAT}{Угарит} (4810 лет), 
    \href{https://w.wiki/vAU}{Тамла} (3740 лет), 
    \href{https://w.wiki/vAX}{Древний Египет} (3544 лет), 
    \href{https://w.wiki/vAY}{Майя} (3521 год), 
    \href{https://w.wiki/vAZ}{Идалион} (2550 год), 
    \href{https://w.wiki/vAb}{Мероитское царство} (2529 лет) 
    и город-государство \href{https://w.wiki/vAf}{Дильмун} (2500 лет).


\newpage
\index{SPARQL!FILTER EXISTS!Страны, упорядоченные по дате основания}
\begin{lstlisting}[ 
        language=SPARQL, 
	    caption={\href{https://w.wiki/tYc}{Список исторических стран, упорядоченных по дате основания}\protect\footnotemark},
	    label=lst:old_countries,
        numbers=none,
        ]
# List of historical countries sorted by inception date
SELECT ?country ?countryLabel 
(MIN(?start) AS ?min_year)
(MAX(?end)   AS ?max_year) 
(?max_year - ?min_year as ?age) WHERE
{
    ?country p:P31 [ps:P31 wd:Q3024240]. # instance of a historical country
	
    FILTER EXISTS {?country wdt:P571 []}.# skip countries without inception date
    FILTER EXISTS {?country wdt:P576 []}.# skip countries without dissolution date
	
    OPTIONAL {?country p:P571 [ps:P571 ?inception].}# any inception date
    OPTIONAL {?country p:P576 [ps:P576 ?dissolution].}# any dissolution date
	
    BIND(YEAR(?inception) AS ?start)
    BIND(YEAR(?dissolution) AS ?end)  
    SERVICE wikibase:label { bd:serviceParam wikibase:language "ru,en" }
}
GROUP BY ?country ?countryLabel ?min_year ?max_year ?age
ORDER BY DESC(?age)
\end{lstlisting}
\footnotetext{Ссылка на SPARQL-запрос: \href{https://w.wiki/tYc}{https://w.wiki/tYc}.}
	
	\small{\AnswerBackref Вопрос на с.~\pageref{lst:List_of_historical_countries}.}
\end{task}


\begin{task}
\label{answer:population_density}
%
Площадь Израиля составляет \num{20770} км$^2$ с~населением \num{9.09} млн человек, 
    площадь Монголии~--- \num{1566000} км$^2$ с~населением \num{3.08} млн человек, 
    площадь Республики Корея~--- \num{100295}~км$^2$ с населением \num{51.47} млн человек, 
    а~площадь Сингапура~--- \num{719.1} км$^2$ с населением \num{5.89} млн человек. 
    Таким образом, по возрастанию плотности населения страны будут упорядочены так:
		\begin{enumerate}
            \item Монголия (\num{1.96} человек на км$^2$);
			\item Израиль (\num{437.79} человек на км$^2$);
			\item Корея (\num{513.15} человек на км$^2$);
			\item Сингапур (\num{8189.30} человек на км$^2$).
		\end{enumerate}
	
Ответ на вопрос можно получить с помощью запроса~\ref{lst:population_density}.
	
	\begin{lstlisting}[ language=SPARQL, 
	caption={\href{https://w.wiki/tkD}{
	Плотность населения в странах Азии}\protect\footnotemark},
	label=lst:population_density,
    numbers=none,
	]
# Population density in Asian countries
SELECT ?country ?countryLabel ?flag ?area ?population 
(?population / ?area as ?populationDensity)
{
	?country p:P31 [ps:P31 wd:Q6256].# this is a country
	?country wdt:P30 wd:Q48 .   # on the Asian continent 
	?country wdt:P41 ?flag .    # has flag
	?country wdt:P2046 ?area .  # has area
	?country wdt:P1082 ?population. # has population  
	SERVICE wikibase:label {bd:serviceParam wikibase:language "ru"}
}
ORDER BY DESC(?populationDensity)
\end{lstlisting}
\footnotetext{Получено: 53 страны в 2020 году. Ссылка на SPARQL-запрос: \href{https://w.wiki/tkD}{https://w.wiki/tkD}.}
	
	
\newthought{Результаты работы} вы можете увидеть в виде <<плиточки>> из флагов. 
Для этого на~странице \emph{Wikidata Query Service} под кнопкой запуска скрипта 
в выпадающем списке выберите \index{Wikidata Query Service!Image grid} \emph{Image~grid}.
	
\small{\AnswerBackref Вопрос на с.~\pageref{lst:without_inception}.}
\end{task}



\begin{task}
\label{answer:official_language}
\newthought{Официальными языками} \href{https://w.wiki/myt}{России} являются 
    \href{https://w.wiki/myv}{абазинский}, 
    \href{https://w.wiki/myx}{мокшанский} 
    и \href{https://w.wiki/myy}{эрзянский} языки. 
    Ответ на вопрос можно проверить, выполнив запрос~\ref{lst:official_languages}.
	
\index{SPARQL!FILTER!Официальные языки в России}
\begin{lstlisting}[ 
            language=SPARQL, 
            caption={\href{https://w.wiki/tky}{Официальные языки в России}\protect\footnotemark},
            label=lst:official_languages,
            numbers=none,
                ]
# Official languages in Russia
SELECT ?lanquage ?lanquageLabel WHERE
{ 
	wd:Q159 p:P37 [ps:P37 ?lanquage]. # Russia has the official language
	SERVICE wikibase:label {bd:serviceParam wikibase:language "ru"}
} ORDER BY ?lanquageLabel
\end{lstlisting}
\footnotetext{Получено: 37 языков в 2020 году. Ссылка на SPARQL-запрос: \href{https://w.wiki/tky}{https://w.wiki/tky}.}
	
\small{\AnswerBackref Вопрос на с.~\pageref{lst:List_of_historical_countries}.}
\end{task}





%%%%%%%%%%%%%% oblast_of_Russia %%%%%%%%%%%%%%
\hfil\pgfornament[width=4cm]{80}\hfil%

\begin{task}
\label{answer:subjects_of_Russia_3}
Приведённому описанию соответствует флаг Московской области. 
    Иллюстрации флагов для каждого из субъектов России 
    можно получить с помощью запроса~\ref{lst:subjects_of_Russia_3_q}.
	
	\begin{lstlisting}[ language=SPARQL, numbers=none,
	caption={\href{https://w.wiki/4cPg}{Флаги субъектов России}\protect\footnotemark},
	label=lst:subjects_of_Russia_3_q
	]
# List of flags of the subjects of Russia
#defaultView:ImageGrid
SELECT ?subject ?subjectLabel ?flag
WHERE
{
  { ?subject wdt:P31 wd:Q835714 } UNION  # Oblast of Russia
  { ?subject wdt:P31 wd:Q41162 } UNION  # Republic of Russia
  { ?subject wdt:P31 wd:Q183342 } UNION  # Federal city of Russia
  { ?subject wdt:P31 wd:Q831740 } UNION  # Krai of Russia
  { ?subject wdt:P31 wd:Q309166 } UNION # Autonomus oblast of Russia
  { ?subject wdt:P31 wd:Q184122 } # Autonomus okrug of Russia
  
  SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
   
  ?subject wdt:P41 ?flag
}
\end{lstlisting}
\footnotetext{Получено: 86 записей в 2021 году. Ссылка на SPARQL-запрос: \href{https://w.wiki/4cPg}{https://w.wiki/4cPg}.} 
	
\small{\AnswerBackref Вопрос на с.~\pageref{lst:oblast-of-Russia}.}
\end{task}



\begin{task}
\label{answer:subjects_of_Russia_1}
Таким регионом является Карелия. 
    Она расположена на северо-западе России, возникла в 1920 году. 
    Граничит с Ленинградской, Вологодской, Архангельской и Мурманской областями. 
    Также граничит с Финляндией на западе.  
    Ответ на вопрос можно получить с~помощью запроса~\ref{lst:sharesBorderWith}.


\newpage
\begin{lstlisting}[ language=SPARQL, numbers=none,
	caption={\href{https://w.wiki/4cPh}{Границы и дата возникновения субъектов РФ}\protect\footnotemark},
	label=lst:sharesBorderWith
	]
# Borders and date of origin of the subjects of the Russian Federation
SELECT ?subject ?subjectLabel ?sharesBorderWith ?sharesBorderWithLabel ?year 
WHERE {
  { ?subject wdt:P31 wd:Q835714 } UNION  # Oblast of Russia
  { ?subject wdt:P31 wd:Q41162 } UNION  # Republic of Russia
  { ?subject wdt:P31 wd:Q183342 } UNION  # Federal city of Russia
  { ?subject wdt:P31 wd:Q831740 } UNION  # Krai of Russia
  { ?subject wdt:P31 wd:Q309166 } UNION # Autonomus oblast of Russia
  { ?subject wdt:P31 wd:Q184122 } # Autonomus okrug of Russia
  
  SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
  
  ?subject wdt:P47 ?sharesBorderWith. 
  ?subject wdt:P571 ?year.      # ?year is inception date of ?subject
}
\end{lstlisting}
\footnotetext{Получено: 485 пар граничащих друг с другом регионов России в 2021 году. Ссылка на SPARQL-запрос: \href{https://w.wiki/6hwN}{https://w.wiki/6hwN}.} 
	
\small{\AnswerBackref Вопрос на с.~\pageref{lst:sharesBorderWith-oblast-of-Russia}.}
\end{task}



\begin{task}
	\label{answer:subjects_of_Russia_2}
    \newthought{Сейчас в состав Российской Федерации} входят: Республика Адыгея, 
    Камчатский край, Чукотский автономный округ; не входит Читинская область. 
    Ответ на вопрос можно проверить, 
    выполнив запрос~\ref{lst:subjects-of-Russia} на с.~\pageref{lst:subjects-of-Russia}.

\small{\AnswerBackref Вопрос на с.~\pageref{lst:sharesBorderWith-empty-oblast-of-Russia}.}
\end{task}



\hfil\pgfornament[width=4cm]{80}\hfil%
\newpage
%%%%%%%%%%%%%% Operating system chapter %%%%%%%%%%%%%%

\begin{task}
\label{answer:os_base}
\newthought{На основе \href{https://w.wiki/n8W}{Ubuntu}} 
    разработано больше всего операционных систем, а именно~11. 
    Ответ на вопрос можно получить с помощью запроса~\ref{lst:os_base}.

\begin{lstlisting}[ language=SPARQL, 
    numbers=none,
    caption={\href{https://w.wiki/uLR}{Список базовых операционных систем}\protect\footnotemark},
	label=lst:os_base
	]
SELECT ?baseLabel (COUNT(*) AS ?count)
WHERE
{
	?os wdt:P31 wd:Q9135. # is instance of operating system
	?os wdt:P144 ?base.   # is based on ?base
	SERVICE wikibase:label {bd:serviceParam wikibase:language "ru,en"}
}
GROUP BY ?baseLabel
ORDER BY DESC(?count) ASC(?baseLabel)\end{lstlisting}
\footnotetext{Получено: 118 операционных систем на 2020 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/uLR}{https://w.wiki/uLR}.}

\small{\AnswerBackref Вопрос на с.~\pageref{lst:base_of_operating_systems}.}
\end{task}



\begin{task}
\label{answer:what_system_created}
Компания \href{https://w.wiki/n8S}{Apple} разработала 
    операционную систему \href{https://w.wiki/n8P}{Newton~OS}. 
    Ответ на вопрос можно получить, выполнив запрос~\ref{lst:os_creators}.

\begin{lstlisting}[ language=SPARQL, 
    numbers=none,
    caption={\href{https://w.wiki/n8a}{Разработчики операционных систем}\protect\footnotemark},
	label=lst:os_creators
	]
SELECT ?os ?osLabel ?developer ?developerLabel WHERE {
	?os wdt:P31 wd:Q9135. # instance of operating system
	SERVICE wikibase:label {bd:serviceParam wikibase:language "ru, en"}
	OPTIONAL { ?os wdt:P178 ?developer. }
}\end{lstlisting}
\footnotetext{Получено: 1115 операционных систем с~указанием разработчиков и без них на 2020 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/n8a}{https://w.wiki/n8a}.}

\small{\AnswerBackref Вопрос на с.~\pageref{lst:inception_time_of_operating_systems}.}
\end{task}




\newpage
\begin{task}
	\label{answer:os_and_developers}
	\newthought{Список разработчиков операционных систем формируется запросом~\ref{lst:os_creators_2}.}

\begin{lstlisting}[ language=SPARQL, 
    numbers=none,
    caption={\href{https://w.wiki/vGQ}{Разработчики операционных систем}\protect\footnotemark},
    label=lst:os_creators_2
	]
SELECT ?os ?osLabel ?developer ?developerLabel WHERE {
    ?os wdt:P31 wd:Q9135. # os is instance of operating system
    ?os wdt:P178 ?developer. # os developed by developer
    SERVICE wikibase:label {bd:serviceParam wikibase:language "ru, en"}
}\end{lstlisting}
\footnotetext{Получено: 548 операционных систем с~заполненным свойством <<разработчик>> на~2020 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/vGQ}{https://w.wiki/vGQ}.}

\small{\AnswerBackref Задание 1 на с.~\pageref{tasks:operating_system_tasks}.}
\end{task}


\begin{task}
\label{answer:os_and_logos}
\newthought{Список логотипов операционных систем можно получить с помощью запроса~\ref{lst:os_logos}.}

\begin{lstlisting}[ language=SPARQL, 
    numbers=none,
    caption={\href{https://w.wiki/vGQ}{Логотипы операционных систем}\protect\footnotemark},
    label=lst:os_logos
	]
SELECT ?os ?osLabel ?image WHERE {
    ?os wdt:P31 wd:Q9135.
    ?os wdt:P18 ?image.
    SERVICE wikibase:label {bd:serviceParam wikibase:language "ru, en"}
}\end{lstlisting}
\footnotetext{Получено: 182 операционные системы с~заполненным свойством <<логотип>> на 2020 год. Ссылка на~SPARQL-запрос: \href{https://w.wiki/vGQ}{https://w.wiki/vGQ}.}

\small{\AnswerBackref Задание 2 на с.~\pageref{tasks:operating_system_tasks}.}
\end{task}

\begin{task}
\label{answer:os_country}
Список стран происхождения операционных систем можно получить с помощью запроса~\ref{lst:os_development_country}.

\begin{lstlisting}[ language=SPARQL, 
    numbers=none,
    caption={\href{https://w.wiki/vGX}{Страны происхождения операционных систем}\protect\footnotemark},
	label=lst:os_development_country
	]
SELECT ?os ?osLabel ?country ?countryLabel WHERE {
	?os wdt:P31 wd:Q9135.
	?os wdt:P495 ?country.
	SERVICE wikibase:label { bd:serviceParam wikibase:language "ru, en" }
}\end{lstlisting}
\footnotetext{Получено: 10 операционных систем с~заполненным свойством <<страна происхождения>> на 2020 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/vGX}{https://w.wiki/vGX}.}

\small{\AnswerBackref Задание 3 на с.~\pageref{tasks:operating_system_tasks}.}
\end{task}




\newpage
\begin{task}
\label{answer:os_and_bases}
Для получения такого дерева, где операционные системы верхнего уровня дерева  
основаны на ОС, перечисленных на нижнем уровне, выполните запрос~\ref{lst:os_and_bases}.

\begin{lstlisting}[ 
        language=SPARQL, 
        caption={\href{https://w.wiki/vGc}{Дерево операционных систем и их основ}\protect\footnotemark},
        label=lst:os_and_bases,
        numbers=none,
	            ]
#defaultView:Tree
SELECT ?base ?baseLabel ?baseImage ?baseLogoImage
?os ?osLabel ?osImage ?osLogoImage
WHERE
{
	?os wdt:P31 wd:Q9135.
	?os wdt:P144 ?base.
	OPTIONAL { ?base wdt:P18 ?baseImage. }
	OPTIONAL { ?base wdt:P154 ?baseLogoImage. }
	OPTIONAL { ?os wdt:P18 ?osImage. }
	OPTIONAL { ?os wdt:P154 ?osLogoImage. }
SERVICE wikibase:label { bd:serviceParam wikibase:language "ru, en" }
}
\end{lstlisting}
\footnotetext{Получено: 136 операционных систем с~<<предками>> на 2020 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/vGc}{https://w.wiki/vGc}.}

\small{\AnswerBackref Задание 4 на с.~\pageref{tasks:operating_system_tasks}.}
\end{task}




\hfil\pgfornament[width=4cm]{80}\hfil%
\newpage
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%    Языки программирование
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

\begin{task}
\label{answer:prog_lang_1}
Язык программирования \href{https://ru.wikipedia.org/wiki/Ада_(язык_программирования)}{Ада} 
    разработал Жан Ишбиа, 
    \href{https://ru.wikipedia.org/wiki/Форт_(язык_программирования)}{Форт}~--- Чарльз Мур, 
    а создателем языка \href{https://ru.wikipedia.org/wiki/Erlang}{Erlang} считается Джо Армстронг. 
    Ответ на вопрос можно получить с помощью запроса~\ref{lst:prog_lang_creators}. 

\begin{lstlisting}[
        language=SPARQL, 
        caption={{\href{https://w.wiki/v4Q}{Создатели языков программирования}}\protect\footnotemark}, 
        label=lst:prog_lang_creators,
        numbers=none,
                ]
# Get developers of programming languages
SELECT ?itemLabel ?developerLabel WHERE 
{
  ?item wdt:P31 wd:Q9143;    # is programming language
        wdt:P178 ?developer. # has developer
  SERVICE wikibase:label { bd:serviceParam wikibase:language "ru,en" }
}
ORDER BY DESC (?item_label)
\end{lstlisting}
\footnotetext{Получено: 520 разработчиков в~2020~году, 553~--- в~2023 году. Ссылка на~SPARQL-запрос: \href{https://w.wiki/6i28}{https://w.wiki/6i28}.}

\small{\AnswerBackref Вопрос на с.~\pageref{question:prog_lang_1}.}
\end{task}



\begin{task}
\label{answer:prog_lang_2}
\newthought{Логотипом языка программирования} 
    \href{https://ru.wikipedia.org/wiki/LOLCODE}{LOLCODE} является третья картинка. 
    Ответ на вопрос также можно получить, выполнив запрос~\ref{lst:prog_lang_logotype}. 
\begin{lstlisting}[
            language=SPARQL, 
            caption={{\href{https://w.wiki/v4U}{Логотипы языков программирования}}\protect\footnotemark}, 
            label=lst:prog_lang_logotype,
            numbers=none,
                  ]
#defaultView:ImageGrid
SELECT ?itemLabel ?image WHERE
{
    ?item wdt:P154 ?image. # image
    SERVICE wikibase:label { bd:serviceParam wikibase:language "en,ru" }
}
\end{lstlisting}
\footnotetext{Получено: \num{87066} логотипов в 2020 году. Ссылка на SPARQL-запрос: \href{https://w.wiki/v4U}{https://w.wiki/v4U}.}

\small{\AnswerBackref Вопрос на с.~\pageref{question:prog_lang_2}.}
\end{task}



\newpage
\begin{task}
    \label{answer:prog_langs_4}
    Список языков программирования со свойством \wdProperty{822}{персонаж-талисман} (маск\'{о}т)
    можно получить, выполнив запрос~\ref{lst:prog_lang_answer_4}. 
    Подумайте, как расширить запрос, чтобы увидеть иллюстрации этих маскотов.

\begin{lstlisting}[
            language=SPARQL, 
            caption={{\href{https://w.wiki/6i8q}{Персонажи-талисманы языков программирования}}\protect\footnotemark}, 
            label=lst:prog_lang_answer_4,
            numbers=none,
                  ]
# List of programming languages with mascot
SELECT ?lang ?langLabel ?mascot ?mascotLabel
WHERE {
    ?lang wdt:P31 wd:Q9143.
    ?lang wdt:P822 ?mascot.
    SERVICE wikibase:label { bd:serviceParam wikibase:language "ru,en" }
}
\end{lstlisting}
\footnotetext{Получено: 3 языка программирования в 2020 году, 6~--- в 2023 году. 
        Ссылка на SPARQL-запрос: \href{https://w.wiki/6i8q}{https://w.wiki/6i8q}.}
    
    \small{Задание~1 на~с.~\pageref{prog_lang_test}.}
\end{task}




\begin{task}
    \label{answer:prog_langs_5}
Получить список языков программирования, разработанных до 1992 года, 
    можно с~помощью запроса~\ref{lst:prog_lang_answer_5}. 

	\begin{lstlisting}[
        language=SPARQL, 
        caption={{\href{https://w.wiki/v4f}{Языки программирования, появившиеся до 1992 года}}\protect\footnotemark}, 
        label=lst:prog_lang_answer_5,
        numbers=none,
                    ]
# Programming languages developed before 1992
SELECT DISTINCT ?lang ?langLabel (year(?inception) as ?year) WHERE 
{
  ?lang wdt:P31 wd:Q9143;    # is programming language
        wdt:P571 ?inception. # date of inception
  FILTER(year(?inception) < 1992)
  SERVICE wikibase:label { bd:serviceParam wikibase:language "ru,en" }
}
\end{lstlisting}
\footnotetext{Получено: 207 языков программирования в~2020 году, 377~--- в 2023 году. 
              Ссылка на SPARQL-запрос: \href{https://w.wiki/v4f}{https://w.wiki/v4f}.}
    
\small{Задание~2 на~с.~\pageref{prog_lang_test}.}
\end{task}



\newpage
\begin{task}
    \label{answer:prog_langs_6}
    Чтобы построить столбчатую диаграмма числа различных хештегов 
    для~каждого из~языков программирования, 
    используем свойство \wdProperty{2572}{hashtag} в~запросе~\ref{lst:prog_lang_answer_6}. 

    Отметим, что в 2023 году только два языка имели больше одного хештега: 
    язык C++ (хештеги cpp и cplusplus) и язык Go (хештеги golang и GoogleGo).

\begin{lstlisting}[
            language=SPARQL, 
            caption={{\href{https://w.wiki/v4h}{Число хештегов у языков программирования}}\protect\footnotemark}, 
            label=lst:prog_lang_answer_6,
            numbers=none,
                ]
# Number of hashtags for programming languages
#defaultView:BarChart
SELECT DISTINCT ?lang ?langLabel (count(*) as ?count) WHERE
{
    ?lang wdt:P31 wd:Q9143; # is programming language
          wdt:P2572 ?count. # has hashtag
    SERVICE wikibase:label { bd:serviceParam wikibase:language "ru,en" }
} 
GROUP BY ?lang ?langLabel
ORDER BY DESC(?count)
\end{lstlisting}
\footnotetext{Получено: 3 языка программирования с~хештегами в 2020 году, 
              10~языков~--- в~2023 году. Ссылка на SPARQL-запрос: \href{https://w.wiki/v4h}{https://w.wiki/v4h}.}
    
\small{Задание~3 на~с.~\pageref{prog_lang_test}.}
\end{task}





\hfil\pgfornament[width=4cm]{80}\hfil%
\newpage
%%%%%%%%%%%%%%%%%%%  Ship chapter  %%%%%%%%%%%%%%%%%%

\begin{task}
\label{answer:ship_Guinness}
<<Корабли Гиннесса>>. 
    Выполним поиск выдающихся по каким-либо параметрам кораблей в Викиданных.
    Например, известно, что \Wikiref{Seawise Giant}~--- это самый длинный нефтяной танкер.

Приведём примеры возможных решений через Викиданные. 
При этом данные могут неточными из-за неполноты информации об объектах в Викиданных, 
    см. запросы~\ref{lst:long_ship} и~\ref{lst:wide_ship}.

\begin{lstlisting}[ 
            language=SPARQL, 
            caption={{\href{https://w.wiki/3L2R}{Самые длинные корабли}}\protect\footnotemark}, 
            label=lst:long_ship,
            numbers=none,
                ]
# The ship with maximum length
SELECT ?ship ?shipLabel ?max_length WHERE {
{
    SELECT (MAX(?length) as ?max_length) WHERE
    {
        ?ship wdt:P31 wd:Q11446; # is ship
              wdt:P2043 ?length
    }
}
  {?ship wdt:P31 wd:Q11446; wdt:P2043 ?max_length}
		
  SERVICE wikibase:label { bd:serviceParam wikibase:language "ru, en" }
}
\end{lstlisting}
\footnotetext{Самым длинным кораблём оказался непостроенный \Wikiref{Хаббакук} длиной 1200 метров. Ссылка на SPARQL-запрос: \wwiki{3L2R}.}

Внутренний \lstinline|SELECT| запроса~\ref{lst:long_ship} находит максимальную длину корабля, 
а внешний \lstinline|SELECT| находит корабль с такой длиной. 

Более простой и прямолинейный скрипт (URL:~\href{https://w.wiki/6iAd}{https://w.wiki/6iAd}) 
находит на 2023 год 167 кораблей длиной более 350 метров. 




\newpage
\begin{lstlisting}[ 
            language=SPARQL, 
            caption={{\href{https://w.wiki/wKv}{Изображения кораблей, отсортированных по ширине корабля}}\protect\footnotemark}, 
            label=lst:wide_ship, 
            numbers=none,
                  ]
# List of ships' images sorted by width of ship
#defaultView:ImageGrid
SELECT ?ship ?shipLabel ?image ?beam WHERE 
{
    ?ship wdt:P31 wd:Q11446; # is ship
          wdt:P2261 ?beam;   # width of ship is ?beam
    OPTIONAL { ?ship wdt:P18 ?image }
    SERVICE wikibase:label {bd:serviceParam wikibase:language "ru, en"}
}
ORDER BY DESC(?beam)
\end{lstlisting}
\footnotetext{Самым широким кораблем также оказался 
    \href{https://www.wikidata.org/wiki/Q1156392}{проект авианосца Хабаккук} 
    из льда и опилок, ширина которого составила 180 метров. 
    Среди реально существовавших кораблей самым широким был норвежский корабль 
    \href{https://www.wikidata.org/wiki/Q11987454}{M/S Isosaari (Q11987454)} шириной 99 метров. 
    SPARQL-запрос: \href{https://w.wiki/wKv}{https://w.wiki/wKv}.}

\small{Задание на с.~\pageref{question:ship_Guinness}.}
\end{task}




\begin{task}
\label{answer:ship_stamp}
На марке изображён советский эсминец~<<\ruwiki{vgE}{Гремящий}>>.

\small{Задание на с.~\pageref{question:ship_stamp}.}
\end{task}




\begin{task}
\label{answer:ship_book}

Найдём корабли, снятые в фильмах, с помощью запроса~\ref{lst:cinema_ship}. 

\begin{lstlisting}[ 
            language=SPARQL, 
            caption={{\href{https://w.wiki/waV}{Изображения кораблей, снятых в фильмах}}\protect\footnotemark}, 
            label=lst:cinema_ship, 
            numbers=none,
                ]
# Images of ships used in movies
#defaultView:ImageGrid
SELECT DISTINCT ?film ?filmLabel ?ship ?shipLabel ?image
WHERE
{
	?film wdt:P31 wd:Q11424. # is film	
	?film wdt:P921 ?ship . # main subject
	?ship wdt:P31/wdt:P31 wd:Q2235308 . # is ship
	OPTIONAL { ?ship wdt:P18 ?image } # ship's image
								
	SERVICE wikibase:label {bd:serviceParam wikibase:language "ru, en"}
}
\end{lstlisting}
\footnotetext{Найдено четыре изображения кораблей, снятых в кинолентах, 2021 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/waV}{https://w.wiki/waV}.}



\newpage
Найдём корабли, описанные в книгах, с помощью запроса~\ref{lst:books_ship}. 
\begin{lstlisting}[ 
            language=SPARQL, 
            caption={{\href{https://w.wiki/wXF}{Изображения кораблей, о которых писали в книгах}}\protect\footnotemark}, 
            label=lst:books_ship, 
            numbers=none,
                ]
# Images of ships used in books
#defaultView:ImageGrid
SELECT DISTINCT ?book ?bookLabel ?ship ?shipLabel ?image
WHERE
{
	?film wdt:P31 wd:Q571. # is book	
	?film wdt:P921 ?ship . # main subject
	?ship wdt:P31/wdt:P31 wd:Q2235308 . # is ship
	OPTIONAL { ?ship wdt:P18 ?image } # ship's image
									
	SERVICE wikibase:label {bd:serviceParam wikibase:language "ru, en"}
}
\end{lstlisting}
\footnotetext{Найдено пять изображений кораблей, о которых было написано в~книгах, 2021 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/wXF}{https://w.wiki/wXF}.}
	
\small{Задание на с.~\pageref{question:ship_book}.}
\end{task}






\hfil\pgfornament[width=4cm]{80}\hfil%
\newpage
%%%%%%%%%%%%%% spacecraft chapter %%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

\begin{task}
    \label{answer:spacecraft_USSR}
    Космические аппараты, 
    изображённые на с.~\pageref{question:spacecraft_soyuz19} (Союз--19), 
    с.~\pageref{question:spacecraft_soyuzT} (Союз--7К) и с.~\pageref{question:spacecraft_lunar} 
    (лунный посадочный модуль <<Космос>>), принадлежат СССР. 
    Убедиться в этом можно, выполнив запрос~\ref{lst:imageUSSRsc}.

    \begin{lstlisting}[ 
        language=SPARQL, 
        numbers=none, 
        caption={{\href{https://w.wiki/6iET}{Набор изображений космических аппаратов СССР}}\protect\footnotemark}, 
        label=lst:imageUSSRsc, 
        ]
# List of images of USSR spacecraft
#defaultView:ImageGrid
SELECT ?rocket ?rocketLabel ?img WHERE
{
  ?rocket wdt:P31 wd:Q40218; # is spacecraft
          wdt:P17 wd:Q15180; # from USSR
          wdt:P18 ?img.      # has image
  SERVICE wikibase:label {bd:serviceParam wikibase:language "ru"}
}
}\end{lstlisting}
\footnotetext{Получено: 4 космических корабля в~2023 году. Ссылка на~SPARQL-запрос: \href{https://w.wiki/6iET}{https://w.wiki/6iET}.}

\small{Вопросы на с.~\pageref{question:spacecraft_soyuz19}, 
    \pageref{question:spacecraft_soyuzT} и \pageref{question:spacecraft_lunar}.}
\end{task}



\newpage
\begin{task}
\label{answer:launches_USSR}
Запрос~\ref{lst:launch_USSR} строит график запуска отечественных космических аппаратов по десятилетиям.
    В 1960-е годы совершено 16~запусков, в~1970-е~--- 42, а~в~1980-е~--- 39~запусков.

\begin{lstlisting}[ 
                language=SPARQL, 
                numbers=none, 
                caption={{\href{https://w.wiki/4eQK}{Диаграмма запусков отечественных космических кораблей по десятилетиям}}\protect\footnotemark}, 
                label=lst:launch_USSR
              ]
# The number of spacecraft launches in Russia every 10 years
#defaultView:BarChart
SELECT (STR(?lapse) AS ?lapse_str) (COUNT(?item) AS ?quantity)
WHERE {                  # spacecraft belongs to
        {?item wdt:P17 wd:Q15180}               # country = USSR
  UNION {?item wdt:P17 wd:Q159}               # country = Russia
  UNION {?item wdt:P495 wd:Q159}    # country of origin = Russia
  UNION {?item wdt:P495 wd:Q15180}.  # country of origin =  USSR
  
  ?item wdt:P619 ?launch. # date of spacecraft launch (P619)
  BIND( YEAR(?launch) AS ?year) 
  BIND(FLOOR(?year/10)*10 AS ?lapse) # count for each 10 years
SERVICE wikibase:label {bd:serviceParam wikibase:language "ru,en"}
} 
GROUP BY ?lapse
ORDER BY ?lapse # Order 1960, 1970, 1980, ...
\end{lstlisting}
\footnotetext{Диаграмма построена для семи десятилетий, 2021 год. SPARQL-запрос: \href{https://w.wiki/4eQK}{https://w.wiki/4eQK}.}

\small{\AnswerBackref Вопрос на с.~\pageref{question:spacecraft_1}.}
\end{task}


\newpage
\begin{task}
    Подсчитаем число запусков ракет за каждые 10 лет в период с~1970 по~2020 год с~помощью запроса~\ref{lst:launchesWorld10}.
    \begin{lstlisting}[ 
            language=SPARQL, 
            numbers=none, 
            caption={{\href{https://w.wiki/6iFk}{Число запусков космических кораблей в мире по десятилетиям (1970--2020)}}\protect\footnotemark}, 
            label=lst:launchesWorld10, 
                      ]
# Get number of launches for each 10 years from 1970 to 2020
SELECT (STR(?lapse) AS ?lapse_str) (COUNT(?item) AS ?quantity) 
WHERE {                  
    ?item wdt:P619 ?launch.       # date of spacecraft launch
    BIND( YEAR(?launch) AS ?year) 
    ?item wdt:P17 ?country.       # check existing country
    BIND(FLOOR(?year/10)*10 AS ?lapse) # count for each 10 years
    FILTER (?year > 1969 && ?year < 2020) # check date
} 
GROUP BY ?lapse
\end{lstlisting}
\footnotetext{Получено: в 1970-е годы было запущено минимальное число космических кораблей в мире~--- 70, 
                        в 2010-е годы максимальное число запусков~--- 337 
                        по данным на 2023 год. 
    Ссылка на~SPARQL-запрос: \href{https://w.wiki/6iFk}{https://w.wiki/6iFk}.}

    \small{\AnswerBackref Вопрос на с.~\pageref{question:spacecraft_2}.}
\label{answer:max-min-space-launches}
\end{task}


