\chapter[Анализ стран: возраст, формы правления и этнохоронимы]{Анализ трёх аспектов современных стран по Викиданным: возраст стран, популярные формы правления и этнохоронимы}
\label{ch:country}

Глава посвящена исследованию стран на основе базы знаний международного проекта Викиданные. С помощью SPARQL-запросов, вычисляемых на объектах <<страна>> в Викиданных, получены: список всех ныне существующих стран, перечень стран, упорядоченных по дате создания, список этнохоронимов стран, пузырьковая диаграмма с формами правления стран, граф соседних стран и карту соседних стран России. Кроме того, проанализирована полнота Викиданных по этой теме.
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

\begin{marginfigure}[0.0cm]
	{
		\setlength{\fboxsep}{0pt}%
		\setlength{\fboxrule}{1pt}%
		\fcolorbox{gray}{gray}{\includegraphics{chapter/country/ProWD_country.png}}
	}
	\caption
	[Степень заполненности свойств стран на Викиданных]
	{
		Высокая степень заполнения по числу свойств объекта Викиданных \href{https://www.wikidata.org/wiki/Q6256}{страна (Q6256)}.  Данные получены с помощью сервиса \href{https://prowd.id/dashboards/86b6f91a8131/profile}{ProWD.id}, 2020 год. \emph{Коэффициент Джини равен 0.091.}
	}%
	\label{fig:ProWD_country}%
\end{marginfigure}


\section{Список стран и степень полноты информации ряда стран}

Построим список всех стран на английском и русском языках (листинг~\ref{lst:country}).

\begin{lstlisting}[ language=SPARQL, 
caption={\href{https://w.wiki/k6L}{Экземпляры объекта <<страна>>}\protect\footnotemark},
label=lst:country, 
]
#List of countries in English and Russian
SELECT ?country ?label_en ?label_ru
WHERE
{
		?country wdt:P31 wd:Q6256. # instance country
		?country rdfs:label ?label_en filter (lang(?label_en) = "en").
		?country rdfs:label ?label_ru filter (lang(?label_ru) = "ru").
}
\end{lstlisting}
\footnotetext{Получено 205 стран на 2017 год и 175 стран на 2020 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/k6L}{https://w.wiki/k6L}}

По степени заполненности свойств на Викиданнных можно различать <<полные>> и  <<пустые>> страны. 

Примерами наиболее полных и проработанных стран на Викиданных по данным ProWD\autocite{prowd_balakireva} являются: \wdqName{Израиль}{801} (127 свойств), \wdqName{Франция}{142} (126 свойств), \wdqName{Соединённые Штаты Америки}{30} (124 свойства).

Наименьшее количество свойств у \wdqName{Соединённых провинций Центральной Америки}{8842993} (3 свойства) и \wdqName{Джалаириды}{8842993} (9 свойств).

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\section{Возраст стран и почему Россия бывает не страной? О конструкции p:/ps:}
\label{ch:RussiaNotCountryPPS}


%%%%%%%%%%%%%%%% Упражнение 2 %%%%%%%%%%%%%%%%
\marginnote{
%	Какое количество административных единиц имеют следующие страны:
	У \href{https://w.wiki/mzN}{Латвии} их 119, у \href{https://w.wiki/mzP}{Таиланда} 77, у \href{https://w.wiki/mzR}{Дании} 5, а у \href{https://w.wiki/myt}{России} 81. О количестве чего идет речь?
	\begin{itemize}
		\item Количество городов с населением более миллиона человек?
		\item Количество высших учебных заведений?
		\item Количество административных единиц?
		\item Количество официальных языков?
	\end{itemize}
	См. ответ~\ref{answer:administrative_territorial} на с.~\pageref{answer:administrative_territorial}.
}

Построим список стран, отсортированных по дате основания страны, то есть по первому упоминанию о стране (листинг~\ref{lst:age_of_country}).

\begin{lstlisting}[ language=SPARQL, 
caption={\href{https://w.wiki/suP}{Даты основания стран}\protect\footnotemark},
label=lst:age_of_country, 
]
# List of countries sorted by inception 
SELECT ?country ?countryLabel ?inception
WHERE
{
	?country wdt:P31 wd:Q6256.    # instance of country
	?country wdt:P571 ?inception. # the first mention
	SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
}
ORDER BY (?inception)
\end{lstlisting}

\footnotetext{Получено  112 стран на 2017 год и 199 стран на 2020. Ссылка на SPARQL-запрос: \href{https://w.wiki/suP}{https://w.wiki/suP}}

В результате выполнения запроса (листинг~\ref{lst:age_of_country}) получен скромный список стран, включающий на 2020 год всего 184 страны. На примере России разберемся, в чем здесь дело. Объект \wdqName{Россия}{159} в поле ``instance of'' содержит не одно, а восемь значений, в том числе \wdqName{country}{6256}.

\marginnote{
	На странице Викиданных \href{https://w.wiki/LX}{``Request a query''} одни редакторы задают вопросы, как написать тот или иной скрипт, а другие редакторы отвечают. Пользуйтесь этим форумом.
}

Решение и ответ на этот вопрос были найдены на странице ``Wikidata: Request a query'', а именно в разделе доступном по ссылке \href{https://w.wiki/tLm}{https://w.wiki/tLm}.

Дело в том, что конструкция wdt позволяет находить только истинные значения. Для России предпочтительным ответом (англ. preferred value) в поле ``instance of'' является <<суверенное государство>>, а не страна. Чтобы проверить все варианты, представленные в поле ``instance of'' России, нужно использовать конструкцию p:/ps:.

Таким образом, скрипт для получения всех 232 стран, отсортированных по дате создания, представлен на листинге~\ref{lst:list_of_country_instance_of}.

\begin{lstlisting}[ language=SPARQL, 
caption={\href{https://w.wiki/tN$}{Список стран, отсортированных по дате основания}\protect\footnotemark},
label=lst:list_of_country_instance_of, 
]
# List of countries sorted by inception date
SELECT ?country ?countryLabel
		(MIN(?year) AS ?min_year)
WHERE
{
	?country p:P31 [ps:P31 wd:Q6256]. # instance of a country 
	?country p:P571 [ps:P571 ?inception]. # all inception dates
	BIND(YEAR(?inception) AS ?year)
	SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
}
GROUP BY ?country ?countryLabel ?min_year
ORDER BY ?min_year
\end{lstlisting}

\footnotetext{Получено  235 стран на 2020 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/tN\$}{https://w.wiki/tN\$}}

Чтобы убрать из этого списка уже не существующие страны, то есть экземпляры объекта \wdqName{historical country}{3024240}, используем оператор MIN US.

С помощью скрипта (листинг~\ref{lst:list_of_country_instance_of_}) получено 211 не исторических стран с известной датой основания.

\begin{lstlisting}[ language=SPARQL, 
caption={\href{https://w.wiki/vLF}{Список стран, отсортированных по дате основания, не включающий исторические страны}\protect\footnotemark},
label=lst:list_of_country_instance_of_, 
]
# List of countries sorted by inception date without historical countries
SELECT ?country ?countryLabel 
(MIN(?year) AS ?min_year)
WHERE
{
	?country p:P31 [ps:P31 wd:Q6256]. # instance of a country 
	MINUS {?country p:P31 [ps:P31 wd:Q3024240]}. # except historical countries
	?country p:P571 [ps:P571 ?inception]. # all inception dates
	BIND(YEAR(?inception) AS ?year)
	SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
}
GROUP BY ?country ?countryLabel ?min_year
ORDER BY ?min_year
\end{lstlisting}

\footnotetext{Получено  211 стран на 2020 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/vLF}{https://w.wiki/vLF}}

Например, \wdqName{Франция}{142}~--- 463 год, \wdqName{Россия}{159}~--- 862 год, \wdqName{Республика Косово}{1246}~--- 2008 год, \wdqName{Южный Судан}{958}~--- 2011. 
Наибольшее количество стран появилось в 1960 (16 стран), в 1991 году (15 стран), в 1962 (6 стран) и в 1821 (6 стран).

Выведем список стран с пустым свойством <<дата основания>> (листинг~\ref{lst:without_inception}).

\begin{lstlisting}[ language=SPARQL, 
caption={\href{https://w.wiki/k6q}{Страны с незаполненной датой основания}\protect\footnotemark},
label=lst:without_inception, 
]
#List of `instances of` "countries without a inception" 
SELECT ?country ?countryLabel 
WHERE
{
?country wdt:P31 wd:Q6256. # country

MINUS { ?country wdt:P571 [] } . # inception of country is empty
SERVICE wikibase:label { bd:serviceParam wikibase:language "en" }
}
\end{lstlisting}

\footnotetext{Получено  100 стран на 2017 год и 7 стран на 2020 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/k6q}{https://w.wiki/k6q}}

\subsection{Полнота Викиданных}

Проанализируем полноту Викиданных: исторические и современные страны.

По данным <<Общероссийского классификатора стран мира>>\autocite{oksm} на Земле существует 251 страна.
%%%%%%%%%%%%%%%% Упражнение 2 %%%%%%%%%%%%%%%%
\marginnote{
	%	Какое количество административных единиц имеют следующие страны:
	Найдите государства, существовавшие дольше всего. 
	См. ответ~\ref{answer:old_countries} на с.~\pageref{answer:old_countries}.
}

Отдельного анализа заслуживают древние, уже не существующие государства, например, \wdqName{Ассирия}{41137}. Объекты таких страны на Викиданных являются экземплярами не объекта <<country>>, а  <<historical country>> (исторические страны). 

С помощью скрипта (листинг~\ref{lst:List_of_historical_countries}) построим список исторических государств. Таких бывших государств оказалось три тысячи, что на порядок больше числа современных государств.

\begin{lstlisting}[ language=SPARQL, 
caption={\href{https://w.wiki/tQN}{Список исторических стран}\protect\footnotemark},
label=lst:List_of_historical_countries, 
]
# List of historical countries
SELECT ?country ?countryLabel
WHERE
{
	?country p:P31 [ps:P31 wd:Q3024240]. # instance of a historical country 
	SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],ru,en"} 
}
\end{lstlisting}

\footnotetext{Получено  3026 стран на 2020 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/tQN}{https://w.wiki/tQN}}

%Отметим, что количество бывших стран (165 на 2020 год) меньше существующих ныне стран.

По данным статьи <<Список государств>>\autocite{list_of_sovereign_states} Русской Википедии существует 252 страны (в  <<Общероссийском классификаторе стран мира>> недостаёт Косово).

По данным статьи ``List of sovereign states''\autocite{list_of_sovereign_states_en} Английской Википедии существует 206 стран.

%%%%%%%%%%%%%%%% Упражнение 3 %%%%%%%%%%%%%%%%
\marginnote{
	Определите по флагам страны Азии и перечислите их в порядке возрастания плотности населения.
}
\begin{marginfigure}[0.0cm]
	{
		\setlength{\fboxsep}{0pt}%
		\setlength{\fboxrule}{1pt}%
		\fcolorbox{gray}{gray}{\includegraphics[width=\linewidth]{./chapter/country/256px-Flag_of_South_Korea.png}}%
	}
	\caption{Флаг первой страны.}%
	\label{fig:flag_kor}%
\end{marginfigure}
\begin{marginfigure}[0.0cm]
	{
		\setlength{\fboxsep}{0pt}%
		\setlength{\fboxrule}{1pt}%
		\fcolorbox{gray}{gray}{\includegraphics[width=\linewidth]{./chapter/country/256px-Flag_of_Singapore.png}}%
	}
	\caption{Флаг второй страны.}%
	\label{fig:flag_singapore}%
\end{marginfigure}


У экземпляров объекта <<\href{https://www.wikidata.org/wiki/Q6256}{страна}>> обычно заполнено свойство \href{https://www.wikidata.org/wiki/Property:P571}{inception (P571)}, то есть дата основания. Однако не всегда точно можно  указать дату основания страны по разным причинам: отсутствие, недостаток или противоречие письменных источников. Например, основание Древнерусского государства связывают с призванием варяжского князя Рюрика в 862 году, но точной даты нет (объект \wdqName{Россия}{159}). Некоторым современным странам предшествовали ряд исторических предшественников, и дату образования какого из них считать за дату создания современной страны ‒ это вопрос открытый. Например, датой основания \wdqName{Монголии}{711} принято считать 29 декабря 1911 года, когда произошло провозглашение независимости от Китая. Хотя в истории Монголия появляется со времён деятельности Чингисхана, который кратковременно в начале \MakeUppercase{\romannumeral13} века объединил под своей властью большую часть Евразии.



%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\section{Этнохоронимы стран на русском языке}

\begin{marginfigure}[0.0cm]
	{
		\setlength{\fboxsep}{0pt}%
		\setlength{\fboxrule}{1pt}%
		\fcolorbox{gray}{gray}{\includegraphics[width=\linewidth]{./chapter/country/256px-Flag_of_Israel.png}}%
	}
	\caption{Флаг третьей страны.}%
	\label{fig:flag_israel}%
\end{marginfigure}
\begin{marginfigure}[0.0cm]
	{
		\setlength{\fboxsep}{0pt}%
		\setlength{\fboxrule}{1pt}%
		\fcolorbox{gray}{gray}{\includegraphics[width=\linewidth]{./chapter/country/256px-Flag_of_Mongolia.png}}%
	}
	\caption{Флаг четвертой страны.}%
	\label{fig:flag_mongolia}%
\end{marginfigure}
\marginnote{
	См. ответ~\ref{answer:population_density} на с.~\pageref{answer:population_density}.
}

Этнохороним~--- это название жителей определённой местности, соотнесённое с топонимом. Например, этнохронимами для России будут россияне, россиянин, россиянка, для Чехии – чехи, чех, чешка.

Помимо географического фактора, новые лексемы, используемые для определения происхождения либо принадлежности, происходят так же от этнических, политических, религиозных характеристик людей\autocite{Zhuravleva2012}. 

Этнохоронимы могут определяться названиями разных объектов земной поверхности: гор, островов, континентов. Так же обозначение места происхождения людей может зависеть от политико-административного деления. Например, для обозначения гражданства: Тайланд~--- тайландцы, Канада~--- канадцы. Внутригосударственное деление также может породить новые наименования, Крым~--- крымчане.

Построим список стран, у которых есть этнохоронимы на русском языке (листинг~\ref{lst:demonym}).


\begin{lstlisting}[ language=SPARQL, 
caption={\href{https://w.wiki/tec}{Список стран с этнохоронимами на русском языке}\protect\footnotemark},
label=lst:demonym, 
]
# List of countries with demonyms in Russian
SELECT ?country ?countryLabel 
WHERE
{
	?country p:P31 [ps:P31 wd:Q6256]. # instance of a country
	?country wdt:P1549 ?demonym .     # has demonym
	FILTER((LANG(?demonym)) = "ru")
	SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
}
GROUP BY ?country ?countryLabel
\end{lstlisting}

\footnotetext{Получено  28 стран на 2017 год и 131 страна на 2021 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/tec}{https://w.wiki/tec}}


\subsection{Cписок этнохоронимов стран}

%%%%%%%%%%%%%%%% Упражнение 4 %%%%%%%%%%%%%%%%
\marginnote{
	Какие из языков \href{https://w.wiki/myv}{абазинский}, \href{https://w.wiki/myx}{мокшанский}, \href{https://w.wiki/myy}{эрзянский}, \href{https://w.wiki/myz}{белорусский} являются официальными в \href{https://w.wiki/myt}{России}?
	См. ответ~\ref{answer:official_language} на с.~\pageref{answer:official_language}.
}

Построим список этнохоронимов стран на русском языке (листинг~\ref{lst:list_demonym}).

\index{SPARQL!FILTER!Cписок этнохоронимов}
\begin{lstlisting}[ language=SPARQL, 
caption={\href{https://w.wiki/teg}{Cписок этнохоронимов}\protect\footnotemark},
label=lst:list_demonym, 
]
# List of demonyms of countries in Russian
SELECT ?country ?countryLabel ?demonym
WHERE
{
	?country p:P31 [ps:P31 wd:Q6256]. # instance of a country
	?country wdt:P1549 ?demonym .     # has demonym
	FILTER((LANG(?demonym)) = "ru")
	SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
}
\end{lstlisting}

\footnotetext{Получено  83 этнохоронима на 2017 год и 296 этнохоронима на 2021 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/teg}{https://w.wiki/teg}}

\subsection{Страны с незаполненными этнохоронимами}

Построим список стран, у которых нет этнохоронимов на русском языке (листинг~\ref{lst:without_demonym}).
\index{SPARQL!FILTER!Страны с незаполненными этнохоронимами на русском языке}
\index{SPARQL!MINUS!Страны с незаполненными этнохоронимами на русском языке}
\begin{lstlisting}[ language=SPARQL, 
caption={\href{https://w.wiki/teo}{Страны с незаполненными этнохоронимами на русском языке }\protect\footnotemark},
label=lst:without_demonym, 
]
#List of countries without demonyms in Russian
SELECT ?country ?countryLabel 
WHERE
{
	?country p:P31 [ps:P31 wd:Q6256].  # instance of a country
	MINUS { ?country wdt:P1549 ?demonym.    # without demonyms
		FILTER((LANG(?demonym)) = "ru") # in Russian
	}
	SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
}
GROUP BY ?country ?countryLabel
\end{lstlisting}

\footnotetext{Получено  170 стран на 2017 год и 105 стран на 2021 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/teo}{https://w.wiki/teo}}

Благодаря конструкции MINUS в листинге~\ref{lst:without_demonym}  в итоговый список не попали страны, имеющие этнохоронимы на русском языке. 

\subsection{Количество заполненных этнохоронимов у стран}

У одной страны может быть от нуля, если данные не заполнены, до трёх-четырёх этнохоронимов. Например, у Турции есть три названия жителей: турок, тарчанка, турки, у Эфиопии четыре: эфиоп, эфиопка, эфиопы, эфиопки.

Выведем список стран, упорядоченный по количеству заполненных в Викиданных этнохоронимов (листинг~\ref{lst:count_demonym}).

\begin{lstlisting}[ language=SPARQL, 
caption={\href{https://w.wiki/tfH}{Список стран, упорядоченный по количеству заполненных этнохоронимов  }\protect\footnotemark},
label=lst:count_demonym, 
]
# List of countries ordered by number of demonyms
SELECT  ?country ?countryLabel (COUNT(*) AS ?demonyms)
WHERE
{
	?country p:P31 [ps:P31 wd:Q6256].# instance of a country
	?country p:P1549 [ps:P1549 []].  # has demonym
	SERVICE wikibase:label {bd:serviceParam wikibase:language "ru"}
}
GROUP BY ?country ?countryLabel 
ORDER BY DESC(?demonyms)
\end{lstlisting}

\footnotetext{Получено 199 стран на 2017 год и 215 стран на 2021 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/tfH}{https://w.wiki/tfH}}

По данным на 2017 год наибольшее число этнохоронимов у Соединённых Штатов Америки (41 этнохороним), затем идут Великобритания (40), Германия (40) и Канада (36). На 2021 год наибольшее число этнохоронимов у Германии (64 этнохоронима), России (61), Канады (60) и США (60). Таким образом, с 2017 по 2021 год добавилось примерно по 20 этнохоронимов на одну страну.


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\section{Формы правления стран}

Построим пузырьковую диаграмму форм правления стран (листинг~\ref{lst:form_of_government}), где размер пузырка будет соответствовать числу стран с той или иной формой правления.


\index{График!BubbleChart!Число стран с разными формами правления}
\begin{lstlisting}[ language=SPARQL, 
caption={\href{https://w.wiki/tfc}{Число стран с разными формами правления}\protect\footnotemark},
label=lst:form_of_government, 
]
# Forms of government ordered by number of countries
#defaultView:BubbleChart
SELECT ?bfog ?form (COUNT(*) AS ?countries)
WHERE 
{
	?country p:P31 [ps:P31 wd:Q6256].# instance of a country
	?country p:P122 [ps:P122 ?bfog].# # basic form of government
	OPTIONAL {
		?bfog rdfs:label ?form
		FILTER (LANG(?form) = "ru")
	}
	SERVICE wikibase:label { bd:serviceParam wikibase:language "ru"}
}
GROUP BY ?bfog ?form
ORDER BY DESC(?countries) ASC(?form)
\end{lstlisting}

\footnotetext{Получено 30 форм правления на 2017 год и 41 форма правления на 2021 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/tfc}{https://w.wiki/tfc}}

Переменная ``bfog'' (сокращение от ``basic form of government'') содержит форму правления, например, <<республику>>. 

Последняя сточка в листинге~\ref{lst:form_of_government} содержит команды упорядочения сначала по убыванию (DESC) и затем по возрастанию (ASC). Таким образом, формы правления сначала сортируются по числу стран (?countries). Затем, если стран поровну, то формы правления сортируются  лексикографически\protect\footnotemark. 

\footnotetext{Лексикографический (словарный) порядок~--- способ упорядочивания и сортировки слов, который обычно используется в словарях, энциклопедиях и алфавитных указателях. Например, А < АА < ААА < ААБ < ААВ < АБ < Б < … < ЯЯЯ.}

В результате выполнения запроса мы получаем пузырьковую диаграмму с наиболее распространенными формами правления в странах на 2017 год (рис.~\ref{fig:bubble_chart_forms_of_government_countries_2017}) и на 2020 год (рис.~\ref{fig:bubble_chart_forms_of_government_countries_2020}).

\begin{figure}
	{
		\setlength{\fboxsep}{0pt}%
		\setlength{\fboxrule}{1pt}%
		\fcolorbox{gray}{gray}{\includegraphics[width=\linewidth]{./chapter/country/Bubble_chart_forms_of_government_countries_according_to_Wikidata.png}}%
	}
	\caption
	[Пузырьковая диаграмма форм правления стран, 2017]
	{Пузырьковая диаграмма форм правления стран, 2017.
		\\			
		По данным на 2017 год основные формы правления стран: республика (в 20 странах), конституционная монархия (в 18 странах), федеративная республика (18), парламентская республика (17) и президентская республика (12).}%
	\label{fig:bubble_chart_forms_of_government_countries_2017}%
\end{figure}

\begin{figure}
	{
		\setlength{\fboxsep}{0pt}%
		\setlength{\fboxrule}{1pt}%
		\fcolorbox{gray}{gray}{\includegraphics[width=\linewidth]{./chapter/country/Bubble_chart_forms_of_government_countries_according_to_Wikidata_2020.png}}%
	}
	\caption
	[Пузырьковая диаграмма форм правления стран, 2020]
	{Пузырьковая диаграмма форм правления стран, 2020.
	\\
	По данным на 2020 год  основные формы правления стран: республика (в 41 стране), конституционная монархия (32), федеративная республика (19), парламентская республика (22) и президентская республика (14).
}%
	\label{fig:bubble_chart_forms_of_government_countries_2020}%
\end{figure}

Таким образом, за период с 2017 по 2020 год форма правления <<республика>> стала более <<популярной>>. Значительно уменьшилось количество стран, имеющих форму  <<смешанная республика>>. Появились такие формы как демократический централизм, демократическая республика, демократия, исламское государство и парламентская демократия.

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\section{Соседние страны}

У стран существует такое свойство, как общая граница. На Викиданных это свойство  \href{https://www.wikidata.org/wiki/Property:P47}{shares border with (P47)}. Используя это свойство, построим граф соседних стран (листинг~\ref{lst:neighboring_countries}).
\index{График!Graph!Соседние стран}
\begin{lstlisting}[ language=SPARQL, 
caption={\href{https://w.wiki/tfo}{Соседние страны}\protect\footnotemark},
label=lst:neighboring_countries, 
]
# Graph of countries which share border
#defaultView:Graph
SELECT ?country ?countryLabel ?border ?borderLabel
WHERE
{
	?country p:P31 [ps:P31 wd:Q6256]. # instance of a country
	OPTIONAL { ?country wdt:P47 ?sharesBorderWith }
	SERVICE wikibase:label {bd:serviceParam wikibase:language "ru"}
}
\end{lstlisting}

\footnotetext{Получено 787 соседств на 2017 год и 912 соседств на 2021 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/tfo}{https://w.wiki/tfo}}

В результате выполнения запроса мы получаем граф с 787 ребрами на 2017 год (рис.~\ref{fig:neighboring_countries_2017}) и 912 ребрами на 2021 год (рис.~\ref{fig:neighboring_countries_2020}), где ребро указывает на общую границу двух стран. Граф представляет из себя несколько связных компонент, так как есть островные страны, у которых нет соседей (например, \href{https://w.wiki/vC7}{Маврикий} и \href{https://w.wiki/vC8}{Мальдивы}). Также стоит упомянуть, что теперь свойство {\textit{shares border with}} включает общую не только сухопутную, но и морскую границу. Поэтому в будущем этот граф будет представлять одну связную компоненту. 

\begin{figure}
	{
		\setlength{\fboxsep}{0pt}%
		\setlength{\fboxrule}{1pt}%
		\fcolorbox{gray}{gray}{\includegraphics[width=\linewidth]{./chapter/country/Neighboring_countries_graph_in_russian_according_to_Wikidata_2017.png}}%
	}
	\caption{Фрагмент графа соседних стран, в центре Россия, 2017.
	}%
	\label{fig:neighboring_countries_2017}%
\end{figure}

\begin{figure}
	{
		\setlength{\fboxsep}{0pt}%
		\setlength{\fboxrule}{1pt}%
		\fcolorbox{gray}{gray}{\includegraphics[width=\linewidth]{./chapter/country/Neighboring_countries_graph_in_russian_according_to_Wikidata_2020.png}}%
	}
	\caption{Фрагмент графа соседних стран, в центре Россия, 2020.
	}%
	\label{fig:neighboring_countries_2020}%
\end{figure}

\subsection{Соседние страны России}

Построим карту соседних стран России (листинг~\ref{lst:neighboring_countries_ru}).

\index{График!Map!Соседние страны России}
\begin{lstlisting}[ language=SPARQL, 
caption={\href{https://w.wiki/tg3}{Соседние страны России}\protect\footnotemark},
label=lst:neighboring_countries_ru, 
]
# Map of neighboring countries of Russia
#defaultView:Map
SELECT ?border_country ?border_countryLabel ?coords ?layer
WHERE 
{                                         # border_country
	?border_country p:P47 [ps:P47 wd:Q159]. #   has border with Russia
	?border_country p:P31 [ps:P31 wd:Q6256].#   is a country
	OPTIONAL {?border_country wdt:P3896 ?coords.}
	BIND (?coords AS ?layer)
	SERVICE wikibase:label { bd:serviceParam wikibase:language "ru". }
}
\end{lstlisting}

\footnotetext{Получено 17 стран на 2021 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/tg3}{https://w.wiki/tg3}}

Строка в листинге~\ref{lst:neighboring_countries_ru} с комментарием ``is a country'' нужна, чтобы проверить, что объект, указанный как <<имеющий общуюю границу>> с Россией является страной. Это позволило исключить из списка район Грузии (Рача-лечхуми и Квемо-Сванети), и например, остров Японии (Хоккайдо), указанные в списке пограничных объектов.

В результате выполнения запроса (листинг~\ref{lst:neighboring_countries_ru}) мы получаем карту соседних стран России (рис.~\ref{fig:neighboring_countries_ru_2020}), включающую 17 стран, а именно: \wdqName{Япония}{17}, \wdqName{Норвегия}{20}, \wdqName{США}{30}, \wdqName{Финляндия}{33}, \wdqName{Швеция}{34}, \wdqName{Польша}{36}, \wdqName{Литва}{37}, \wdqName{Китайская Народная Республика}{148}, \wdqName{Белоруссия}{184}, \wdqName{Эстония}{191}, \wdqName{Латвия}{211}, \wdqName{Украина}{212}, \wdqName{Азербайджан}{227}, \wdqName{Грузия}{230}, \wdqName{Казахстан}{232}, \wdqName{КНДР}{423} и \wdqName{Монголия}{711}.


\begin{figure*}[h]
	{
		\setlength{\fboxsep}{0pt}%
		\setlength{\fboxrule}{1pt}%
		\fcolorbox{gray}{gray}{\includegraphics[width=\linewidth]{./chapter/country/Map_of_neighboring_countries_of_Russia_ru.png}}%
	}
	\caption{Карта соседних стран России, включающая 17 стран, 2021.
	}%
	\label{fig:neighboring_countries_ru_2020}%
\end{figure*}


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\section{Упражнения}

\begin{enumerate}
	\item Постройте список флагов и девизов стран. Девизы есть не у всех стран.
	\item Отметьте на карте столицы современных стран.
	\item В каждой части света вычислите первые пять стран с наибольшей плотностью населения.
	\item Постройте столбчатую диаграмму, демонстрирующую распределение количества стран по формам правления. Оцените, является ли это распределение <<тяжелым хвостом>>\protect\footnotemark.
	\footnotetext{В теории вероятностей , распределение тяжелых хвостов являются вероятностными распределениями, чьи хвосты не экспоненциально ограничены: то есть, они имеют более тяжелые хвосты , чем экспоненциальное распределение. Пример <<тяжелого хвоста>> изображен на рис.~\ref{fig:city_relation_S_N} (зависимость числа городов от числа побратимов) на с.~\pageref{lst:city_relation_Russia_S_N}.}
	\item Выведите список стран, упорядоченных по числу соседей. У каких стран больше всего и меньше всего соседей, какое среднее число соседей? Есть ли корреляция между этим показателем и каким-либо другим параметром стран?
\end{enumerate}


