\chapter{Населённые пункты}
\label{ch:human-settlement}

В главе исследуется объект Викиданных \wdqName{населённый пункт}{486972} и его свойства. 
В каждом из разделов представлены задачи, решённые с помощью SPARQL-запросов. 
%
%%%%%%%%%%%%%%%% Упражнение 1 %%%%%%%%%%%%%%%% 
\marginnote{Подсчитайте, сколько человек на км\textsuperscript{2} живёт в \ruwiki{4dNv}{Барабинске} 
и в~\ruwiki{4dNt}{Алейске}? В каком из этих \emph{населённых пунктов} плотность населения выше?

См. ответ~\ref{answer:human_settlements_density} на с.~\pageref{answer:human_settlements_density}.%
}

Был получен список населённых пунктов, 
построены пузырьковые диаграммы с количеством населения в <<населённых пунктах>> по странам. 
Построена диаграмма, показывающая долю населения, 
проживающего в населённых пунктах относительно всего населения страны. 
Диаграмма показала, что высокий процент населения, проживающего в населённых пунктах, 
приходится на сельскохозяйственные страны, в то время как в более индустриальных странах 
меньшая доля населения проживает в населённых пунктах. 

%%%%%%%%%%%%%%%% Упражнение 2 %%%%%%%%%%%%%%%%
\marginnote{Выберите, представленный герб относится к населённым пунктам Российской Федерации или нет, изображенный на рис. \ref{fig:flag_question_human_settlements1}? }
\begin{marginfigure}[0.0cm] {
\setlength{\fboxsep}{0pt}%
\setlength{\fboxrule}{1pt}%
\fcolorbox{gray}{gray}{\includegraphics[width=0.5\linewidth]{./chapter/human_settlement/Aznakeevskii_rayon_gerb.png}}%
}
  \caption{Герб населённого пункта.}%
  \label{fig:flag_question_human_settlements1}%
\end{marginfigure}

\marginnote{
См. ответ~\ref{answer:flag_human_settlements} на с.~\pageref{answer:flag_human_settlements}.
}
На 2017 год Википедия описывала примерно половину населённых пунктов (75 тыс.), 
Викиданные содержали менее 3\% таких поселений (4 тыс.) относительно данных переписи за 2010 год (155,5 тыс.). 
На 2021 год Викиданные содержат менее 12\% таких поселений (17 тыс.) 
относительно данных той же переписи за 2010 год. 

Для сравнения сельских и городских поселений 
построены диаграммы количества учёных, сгруппированных по родам деятельности, 
и разбитых по месту рождения: сельское или городское.

Для поиска более полных ответов на поставленные выше задачи  
были найдены более общие классы для объекта \wdqName{населённый пункт}{486972} 
с помощью свойства \wdProperty{31}{частный случай понятия}. 
Трудность исследования вызвана отсутствием чёткой типологии населённых пунктов 
(например, от численности населения) в законодательстве России и в Викиданных.

%%%%%%%
\section{Список <<Населённых пунктов>>}

Построим список всех населённых пунктов с помощью запроса~\ref{lst:human-settlement1}.

\begin{lstlisting}[ language=SPARQL, 
                    caption={\href{https://w.wiki/4d7x}{Список всех населённых пунктов}\protect\footnotemark},
                    label=lst:human-settlement1,
                    texcl 
                    ]
# List of all human settlements
SELECT ?hum ?humLabel WHERE{
  ?hum wdt:P31 wd:Q486972. # instance of human settlement
  SERVICE wikibase:label{bd:serviceParam wikibase:language "ru,en"}
}
\end{lstlisting}%
\footnotetext{Получено \num{411393} пунктов в 2017 году. SPARQL-запрос: \href{https://w.wiki/4d7x}{https://w.wiki/4d7x}}

В 2021 году оказалось невозможным получить список населённых пунктов 
из-за большого числа объектов и поэтому слишком долгой работы запроса~\ref{lst:human-settlement1}. 
Для подсчёта числа всех населённых пунктов обратимся к функции \lstinline|COUNT()| 
в запросе~\ref{lst:human-settlement2}.

\index{SPARQL!COUNT!Количество всех населённых пунктов}
\begin{lstlisting}[ language=SPARQL, 
                    caption={\href{https://w.wiki/4d7s}{Количество всех населённых пунктов}\protect\footnotemark},
                    label=lst:human-settlement2,
                    texcl 
                    ]
# Number of human settlements
SELECT (COUNT(?hum) AS ?count) WHERE {
  ?hum wdt:P31 wd:Q486972. # instance of human settlement  
}
\end{lstlisting}%
\footnotetext{Получили \num{563126} населённых пунктов в 2021 году. SPARQL-запрос: \href{https://w.wiki/4d7s}{https://w.wiki/4d7s}}

Среди отечественных населённых пунктов на Викиданных, 
которым соответствуют статьи Русской Википедии, 
почти пустыми являются, например, 
бывшая деревня \wdqName{Борисово}{4093951} (3 свойства) 
и \wdqName{Бригадирское лесничество}{21668554} (4 свойства).

По данным сервиса ProWD 
среди отечественных населённых пунктов 
больше всего свойств (36) у \wdqName{Ялты}{128499}. 
Лидером по всему миру является \wdqName{Токио}{1490} (73 свойства)\autocite{humansettlements_ProWD}.


%%%%%%%
\section{Список стран по суммарному количеству населения}

%%%%%%%%%%%%%%%% Упражнение 2 %%%%%%%%%%%%%%%%
\begin{marginfigure}[1.0cm]
{
\setlength{\fboxsep}{0pt}%
\setlength{\fboxrule}{1pt}%
\fcolorbox{gray}{gray}{\includegraphics[width=0.5\linewidth]{./chapter/human_settlement/Coat_of_Arms_of_Asbest_(Sverdlovsk_oblast).png}}%
}
  \caption{Это герб населённого пункта России или другой страны?\newline%
См. ответ~\protect\ref{answer:flag_human_settlements} на с.~\protect\pageref{answer:flag_human_settlements}.}
  \label{fig:flag_question_human_settlements2}%
\end{marginfigure}

%\marginnote{%
%См. ответ~\ref{answer:flag_human_settlements} на с.~\pageref{answer:flag_human_settlements}.
%}
С помощью запроса~\ref{lst:human-settlement3} 
построим упорядоченный список стран по суммарному количеству населения, проживающего в <<населённых пунктах>>.

%\begin{minipage}{\linewidth}
\marginnote[2cm]{Получена \num{161} страна в 2017 году и \num{213} стран в 2021 году. SPARQL-запрос: \href{https://w.wiki/4d9M}{https://w.wiki/4d9M}}
\index{SPARQL!SUM!Список стран по суммарному количеству населения, проживающего в <<населённых пунктах>>}
\index{SPARQL!GROUP BY!Список стран по суммарному количеству населения, проживающего в <<населённых пунктах>>}
\lstset{numbers=left, firstnumber=1, frame=single}
\begin{lstlisting}[ language=SPARQL, 
    caption={\href{https://w.wiki/4d9M}{Список стран по суммарному количеству населения, проживающего в <<населённых пунктах>>}},
    label=lst:human-settlement3,
    texcl 
                  ]
# List of countries by population in settlements
SELECT ?country ?countryLabel (SUM(?population) as ?sumPopulation)
WHERE {
  ?hum wdt:P31 wd:Q486972;  	# instance of human settlement
       wdt:P17 ?country;    	# in the ?country
       wdt:P1082 ?population. # has ?population
  SERVICE wikibase:label{bd:serviceParam wikibase:language "ru,en"}
}
GROUP BY ?country ?countryLabel 
ORDER BY DESC (?sumPopulation)
\end{lstlisting}%
%\footnotetext{Получена \num{161} страна в 2017 году и \num{213} стран в 2021 году. Ссылка на SPARQL-запрос: \href{https://w.wiki/4d9M}{https://w.wiki/4d9M}}
%\end{minipage}

Для подсчёта количества населения по странам 
используем команду \lstinline|SUM()| во второй строке запроса~\ref{lst:human-settlement3}. 
Для группировки населённых пунктов по странам 
используем команду \lstinline|GROUP BY| на девятой строке того же запроса.

Пузырьковая диаграмма на рис.~\ref{fig:human-settlement-1} 
показывает соотношение стран по количеству населения в <<населённых пунктах>> в 2017 году.

\begin{figure}
\centering
	\includegraphics[width=0.9\linewidth]{./chapter/human_settlement/AnnaBubbleHumanSettlement.jpg}
	\label{fig:human-settlement-1}
    \caption[Пузырьковая диаграмма  по суммарному количеству населения в населённых пунктах, 2017.]{Пузырьковая диаграмма  по суммарному количеству населения, проживающего в <<населённых пунктах>> на 2017 год. Размер пузырька соответствует количеству населения, проживающего в <<населённых пунктах>> одной страны. Ссылка на SPARQL-запрос: \href{https://w.wiki/4dAv}{https://w.wiki/4dAv}}
\end{figure}

\begin{figure}
\centering
	\includegraphics[width=0.9\linewidth]{./chapter/human_settlement/LeonidBubbleHumanSettlement.jpg}
	\label{fig:human-settlement-2}
	\caption[Пузырьковая диаграмма  по суммарному количеству населения в населённых пунктах, 2021.]{Пузырьковая диаграмма  по суммарному количеству населения, проживающего в <<населённых пунктах>> на 2021 год. Размер пузырька соответствует количеству населения, проживающего в <<населённых пунктах>> одной страны. Ссылка на SPARQL-запрос: \href{https://w.wiki/4dAv}{https://w.wiki/4dAv}}
\end{figure}

В 2017 году больше всего населения проживало в <<населённых пунктах>> 
\wdqName{Бразилии}{155} (\num{12} млн), 
\wdqName{Пакистан}{843} (\num{10} млн), 
\wdqName{Мексика}{96} (\num{8} млн), 
\wdqName{Йемен}{805} (\num{8} млн), 
\wdqName{Индия}{668} (\num{7} млн), 
\wdqName{Бангладеш}{902} (\num{7} млн). 

На рис.~\ref{fig:human-settlement-2} можно увидеть список стран на 2021 год: 
\wdqName{Индия}{668} (\num{30} млн), 
\wdqName{Китай}{148} (\num{28} млн), 
\wdqName{Мексика}{96} (\num{17} млн), 
\wdqName{Индонезия}{252} (\num{13} млн), 
\wdqName{Канада}{16} (\num{9} млн), 
\wdqName{Саудовская Аравия}{851} (\num{9} млн). 

Итак, результаты запроса~\ref{lst:human-settlement3} в 2017 и 2021 существенно разнятся. 
По этим результатам получается, что за четыре года 
в населённых пунктах Индии стало больше на 23 млн человек. 


%%%%%
\subsection{Полнота Викиданных}

Населённый пункт — это общее название мест с постоянными жителями\autocite{Humansettlements_Dictionary}. По версии редакторов Викиданных в понятие насёленный пункт входят города, сёла, деревни и другие\footnote{Полный список можно увидеть в разделе <<Cписок классов, сопутствующих <<населённому пункту>> в свойстве <<экземпляр>>>> на с.~\pageref{human-settlement:tag1}.}.
Точной информации о количестве населённых пунктов в мире не было найдено. Поэтому проверим полноту населённых пунктов, которые есть в Викиданных и которые использовались для решения задачи. В задачах выше мы использовали свойста \wdProperty{1082}{численность населения} и \wdProperty{17}{государство} (привязанность к стране). Исходя из этого проверку полноты разделим на подзадачи: 
\begin{enumerate} 
  \item Проверка заполнености свойства <<численность населения>>.
  \item Проверка принадлежности к <<государству>>.
\end{enumerate}

%%%%%
\subsection{Проверка заполнености свойства <<численность населения>> }

Для этого напишем \href{https://w.wiki/4FUz}{SPARQL-запрос}\footnotemark, который выведет населённые пункты с незаполненным свойством \href{http://www.wikidata.org/entity/P1082}{численность населения}. 
\footnotetext{ В 2017 году запрос выдал \num{372997} населённых пунктов с незаполненным свойством <<численность населения>>. Проводя ту же проверку в 2021 году, запрос выдал \num{507078} таких населённых пунктов. Ссылка на SPARQL-запрос: \href{https://w.wiki/4FUz}{https://w.wiki/4FUz}} 
Произведя расчеты получаем, что только у 9,3\% населенных пунктов мира указано свойство <<численность населения>> на 2017 год. В 2021 получаем 11,2\% населенных пунктов мира с заполненным свойство <<численность населения>>.

%%%%%
\subsection{Проверка принадлежности к <<государству>>}

А теперь посмотрим населённые пункты, у которых не указана принадлежность к какой-либо стране~--- \href{https://w.wiki/4FV8}{SPARQL-запрос}\footnotemark.

\footnotetext{В 2017 году нашлось \num{8427} объектов, у которых не указана принадлежность к какой-либо стране. В 2021 году таких объектов уже больше~--- \num{27824}. Ссылка на SPARQL-запрос: \href{https://w.wiki/4FV8}{https://w.wiki/4FV8}}
Получалется неполная картина при получении результата решения данной задачи о суммарном количестве населения в населённых пунктах по странам из-за того, что такие объекты существуют.

%%%%%
\section{Доля населения страны, проживающего в <<населённых пунктах>>}

Построим упорядоченный список стран доли населения (в процентах), проживающего в \href{http://www.wikidata.org/entity/Q486972}{населённых пунктах}, относительно числа всех жителей страны (листинг ~\protect\ref{lst:human-settlement6}).

%%%%%%%%%%%%%%%% Упражнение 2 %%%%%%%%%%%%%%%%
\marginnote{
Выберите, представленный герб относится к населённым пунктам Российской Федерации или нет, изображенный на рис. \ref{fig:flag_question_human_settlements3}?
}
\begin{marginfigure}[0.0cm]
{
\setlength{\fboxsep}{0pt}%
\setlength{\fboxrule}{1pt}%
\fcolorbox{gray}{gray}{\includegraphics[width=0.5\linewidth]{./chapter/human_settlement/Loučovice_CoA.jpg}}%
}
  \caption{Герб населённого пункта.}%
  \label{fig:flag_question_human_settlements3}%
\end{marginfigure}

\marginnote{
См. ответ~\ref{answer:flag_human_settlements} на с.~\pageref{answer:flag_human_settlements}.
}

\index{SPARQL!SUM!Соотношение количества людей, проживающих в населённых пунктах, к количеству всех людей в стране}
\begin{lstlisting}[ language=SPARQL, 
                    caption={\href{https://w.wiki/4dE3}{Соотношение количества людей, проживающих в населённых пунктах, к количеству всех людей в стране}\protect\footnotemark},
                    label=lst:human-settlement6,
                    texcl 
                    ]
# An ordered list of the ratio of the number of people living in 
# "human\_settlement" to the number of inhabitants in the country.
SELECT ?country ?countryLabel ?proportionPopulation WHERE {
 SELECT ?country ?countryLabel (SUM(?population / ?pop) 
        as ?proportionPopulation) WHERE {
  ?hum wdt:P31 wd:Q486972;    # instances of human settlement  
       wdt:P17 ?country;         # has ?country 
       wdt:P1082 ?population.    # has ?population
  ?country wdt:P1082 ?pop.    # population in the country
  SERVICE wikibase:label{bd:serviceParam wikibase:language "ru,en"}
 }
 GROUP BY ?country ?countryLabel
}
ORDER BY ?proportionPopulation
\end{lstlisting}%
\footnotetext{Получено \num{158} результатов в 2017 году и \num{206} результатов в 2021 году. Ссылка на SPARQL-запрос: \href{https://w.wiki/4dE3}{https://w.wiki/4dE3}}

Столбчатая диаграмма на рис. ~\ref{fig:human-settlement-3} позволяет увидеть для каждой отдельной страны отношение количества людей, проживающих в \href{http://www.wikidata.org/entity/Q486972}{населённых пунктах}, к числу жителей в стране на 2017 год.

\begin{figure*}
    \setlength{\fboxsep}{0pt}%
    \setlength{\fboxrule}{1pt}%
    \fcolorbox{gray}{gray}{\includegraphics[width=1\linewidth]{./chapter/human_settlement/AnnaShareHumanSettlement.png}}
	\label{fig:human-settlement-3}
	\caption[Диаграмма доли населения страны, 2017.]{Диаграмма доли населения страны, проживающего в <<населённых пунктах>> на 2017 год. Ссылка на SPARQL-запрос: \href{https://w.wiki/4dE3}{https://w.wiki/4dE3}}%
\end{figure*} 

\begin{figure*}
    \setlength{\fboxsep}{0pt}%
    \setlength{\fboxrule}{1pt}%
    \fcolorbox{gray}{gray}{\includegraphics[width=1\linewidth]{./chapter/human_settlement/LeonidShareHumanSettlement.jpg}}
	\label{fig:human-settlement-4}
	\caption[Диаграмма доли населения страны, 2021.]{Диаграмма доли населения страны, проживающего в <<населённых пунктах>> на 2021 год. В 2021 на диаграмму попали только страны с населением более 5 млн человек. Ссылка на SPARQL-запрос: \href{https://w.wiki/4dDx}{https://w.wiki/4dDx}}%
\end{figure*} 

На рис. ~\ref{fig:human-settlement-3} из графика видно, что наиболее высокий процент в 2017 году приходился на следующие страны: Кирибати (78\%), Ниуэ (70\%), Греция (53\%), Тувалу (48\%), Коморы (43\%), Маврикий (42\%). В 2021 году появились изменения : Нигерия (93\%), Папуа — Новая Гвинея (71\%), Израиль (50\%), Греция (47\%), Азербайджан (47\%), Казахстан (37\%). Интересно заметить, что в основном это маленькие островные государства. Вероятно, большая часть жителей этих стран сконцентрирована в населённых пунктах.

На 2017 год рассматривая отдельно страны большой восьмёрки, доля жителей в \href{http://www.wikidata.org/entity/Q486972}{населённых пунктах} составила: \href{http://www.wikidata.org/entity/Q159}{Россия} (\num{2.98}\%), \href{http://www.wikidata.org/entity/Q30}{США} (\num{1.76}\%), \href{http://www.wikidata.org/entity/Q17}{Япония} (\num{0.80}\%), \href{http://www.wikidata.org/entity/Q16}{Канада} (\num{0.26}\%), \href{http://www.wikidata.org/entity/Q142}{Франция} (\num{0.20}\%), \href{http://www.wikidata.org/entity/Q183}{Германия} (\num{0.24}\%), \href{http://www.wikidata.org/entity/Q145}{Великобритания} (\num{0.18}\%), \href{http://www.wikidata.org/entity/Q38}{Италия} (\num{0.07}\%). В 2021 году значения доли населения снизились: \href{http://www.wikidata.org/entity/Q159}{Россия} (0.045\%), \href{http://www.wikidata.org/entity/Q30}{США} (\num{0.014}\%), \href{http://www.wikidata.org/entity/Q17}{Япония} (\num{0.008}\%), \href{http://www.wikidata.org/entity/Q16}{Канада} (\num{0.23}\%), \href{http://www.wikidata.org/entity/Q142}{Франция} (\num{0.005}\%), \href{http://www.wikidata.org/entity/Q183}{Германия} (\num{0.005}\%), \href{http://www.wikidata.org/entity/Q145}{Великобритания} (\num{0.014}\%), \href{http://www.wikidata.org/entity/Q38}{Италия} (\num{0.0005}\%). Отметим, что это страны промышленно развитые.

%%%%%%%%%%%%%%%% Упражнение 2 %%%%%%%%%%%%%%%%
\marginnote{
Выберите, представленный герб относится к населённым пунктам Российской Федерации или нет, изображенный на рис. \ref{fig:flag_question_human_settlements4}?
}
\begin{marginfigure}[0.0cm]
{
\setlength{\fboxsep}{0pt}%
\setlength{\fboxrule}{1pt}%
\fcolorbox{gray}{gray}{\includegraphics[width=0.5\linewidth]{./chapter/human_settlement/POL_Otynia_COA.png}}%
}
  \caption{Герб населённого пункта.}%
  \label{fig:flag_question_human_settlements4}%
\end{marginfigure}

\marginnote{
См. ответ~\ref{answer:flag_human_settlements} на с.~\pageref{answer:flag_human_settlements}.
}

Построенная диаграмма подтверждает следующую гипотезу: высокий процент населения страны, проживающего в \wdqName{населённых пунктах}{486972}, указывает на более аграрную страну. Исходя из представленных выше диаграмм видно, что наиболее высокий процент населения страны, проживающего в населённых пунктах, приходится на островные, южные, жаркие страны, в которых, по-видимому, менее развита промышленность (маленькая территория, небольшое количество населения, удалённость от материков). А индустриальные страны (большой восьмёрки) имеют очень низкий процент населения страны, проживающего в населённых пунктах.

%%%%%
\section{Cписок классов, сопутствующих <<населённому пункту>> в свойстве <<экземпляр>>}
\label{human-settlement:tag1}

Далее классом будем называть каждый элемент в исследуемом объекте на Викиданных, связанный через свойство \wdProperty{31}{экземпляра}. Главная цель этого раздела, получить классы в свойстве <<экземпляр>>, используемые совместно с классом \wdqName{населённый пункт}{486972}. Такие классы будем считать сопутсвующими. Для этого попробуем получить список объектов, имеющих свойство <<населённый пункт>> (листинг ~\protect\ref{lst:human-settlement7}).

Далее классом будем называть каждый элемент в исследуемом объекте на Викиданных, связанный через свойство \wdProperty{31}{экземпляра}

%%%%%%%%%%%%%%%% Упражнение 2 %%%%%%%%%%%%%%%%
\marginnote{
Выберите, представленный герб относится к населённым пунктам Российской Федерации или нет, изображенный на рис. \ref{fig:flag_question_human_settlements5}?
}
\begin{marginfigure}[0.0cm]
{
\setlength{\fboxsep}{0pt}%
\setlength{\fboxrule}{1pt}%
\fcolorbox{gray}{gray}{\includegraphics[width=0.5\linewidth]{./chapter/human_settlement/Coat_of_Arms_of_Azov.png}}%
}
  \caption{Герб населённого пункта.}%
  \label{fig:flag_question_human_settlements5}%
\end{marginfigure}

\marginnote{
См. ответ~\ref{answer:flag_human_settlements} на с.~\pageref{answer:flag_human_settlements}.
}

\begin{lstlisting}[ language=SPARQL, 
                    caption={\href{https://w.wiki/4dEW}{Cписок классов, сопутствующих <<населённому пункту>> в свойстве <<экземпляр>>}\protect\footnotemark},
                    label=lst:human-settlement7,
                    texcl 
                    ]
# List of classes accompanying the human\_settlement in the
# property 'instance of'
SELECT ?inst (COUNT(?hum) as ?sumHum) 
WHERE{          
  ?hum wdt:P31 wd:Q486972; # instance of human settlement
       wdt:P31 ?inst.      # other objects in instance
  SERVICE wikibase:label{bd:serviceParam wikibase:language "ru,en"}
}  
GROUP BY ?inst
\end{lstlisting}%
\footnotetext{Получено 610 результатов в 2017 году и \num{1245} результатов в 2021 году. Ссылка на SPARQL-запрос: \href{https://w.wiki/4dEW}{https://w.wiki/4dEW}}

Для ускорения выполнения (листинг ~\protect\ref{lst:human-settlement7}) выполним следующие два шага.
 
Во-первых, выключим из рассмотрения такие поселения, которые имеют в списке экземпляров только <<населённый пункт>>. Результат не ухудшится, так как в него не будут включёны экземпляры только класса <<населённый пункт>>. С этой целью внесём в наш скрипт строку \num{9} и получим фильтр для отбора нужных поселений.

Во-вторых, в строке \num{8} уберем такие объекты переменной \emph{?inst}, которые имеют свойство \wdqName{государство}{17}. Это позволит отсечь сотни типов населённых пунктов специфичных для отдельных стран, например, административно-территориальная единица России.

Эти перобразования позволили выполнить запрос по всем странам мира за приемлемое время (13 мс) (листинг ~\protect\ref{lst:human-settlement8}).

\lstset{numbers=left, firstnumber=1, frame=single}
\begin{lstlisting}[ language=SPARQL, 
                    caption={\href{https://w.wiki/4dTx}{Cписок классов, сопутствующих <<населённому пункту>> в свойстве <<экземпляр>>, без специфичных для отдельных стран}\protect\footnotemark},
                    label=lst:human-settlement8,
                    texcl 
                    ]
# List of objects with the class of human settlement, without 
# country and single human settlement
SELECT ?inst (COUNT(?hum) as ?sumHum) 
WHERE{ 
  ?hum wdt:P31 wd:Q486972;  # instance of human settlement
       wdt:P31 ?inst.       # other objects in instance
  
  MINUS {?inst wdt:P17 []}. # without country
  FILTER(?inst != wd:Q486972 ). # without human settlement
  SERVICE wikibase:label{bd:serviceParam wikibase:language "ru,en"}
}  
GROUP BY ?inst 
ORDER BY DESC (?sumHum)
\end{lstlisting}%
\footnotetext{Получено 355 записей в 2017 году и 707 записей в 2021 году. Ссылка на SPARQL-запрос: \href{https://w.wiki/4dTx}{https://w.wiki/4dTx}}

В таблице~\ref{tab:human-settlement2} представлены сравнительные результаты между 2017  и 2021 годами, количества классов, сопутствующих <<населённому пункту>> в свойстве <<экземпляр>>.

\begin{table}[h]
\centering
\begin{tabular}{|l|l|l|l|l|}
\hline
номер & название класса                       				& количество на 2017	& количество на 2021 	& разница		\\ \hline
1         & \wdqName{Cёло}{532}     					& \num{2844}                	& \num{4853}		& +\num{2009}	\\
2         & \wdqName{Муниципалитеты}{15284}              		& \num{1181}                	& \num{3376}		& +\num{2195}	\\
3         & \wdqName{Деревни}{5084}					& \num{662}               	& \num{1761}		& +\num{1099}	\\ 
4         & \wdqName{Археологические памятники}{839954}	& \num{425}               	& \num{887}			& +\num{462}	\\ 
5         & \wdqName{Местные поселения}{3257686}		& \num{425}               	& \num{158}			& -\num{257}	\\ 
6         & \wdqName{Разрушенные города}{14616455}     		& \num{423}                	& \num{388}			& -\num{40}	\\
7         & \wdqName{Города}{515}              				& \num{322}                	& \num{545}			& +\num{223}	\\
8         & \wdqName{Малые города}{3957}				& \num{277}               	& \num{446}			& +\num{169}	\\ 
9         & \wdqName{Заброшенные деревни}{350895}		& \num{254}               	& \num{474}			& +\num{220}	\\ 
10       & \wdqName{Внутренние районы}{2983893}		& \num{207}               	& \num{503}			& +\num{296}	\\ \hline
\end{tabular}
\caption{Сравнительные результаты между 2017  и 2021 годами, количества классов, сопутствующих <<населённому пункту>> в свойстве <<экземпляр>>}
\label{tab:human-settlement2}
\end{table}

В 2021 году была преложена ещё одна модернизация (листинг ~\protect\ref{lst:human-settlement7}). А именно: отсечь доисторические поселения таких типов, как поселения \wdqName{латенского периода}{106505016}, \wdqName{бронзового века}{106491277} и \wdqName{доисторического времени, где есть письменность}{106505070}, без явного указания этих трёх объектов. 

Что есть общего у этих трех объектов на Викиданных? Они являются подклассами объектов, которые, в свою очередь, являются экземпляром объектов \wdqName{археологической культуры}{465299}, \wdqName{исторического периода}{11514315}, \wdqName{археологического века}{15401699}, \wdqName{всемирной истории}{200325} и \wdqName{геологического периода}{392928}. Применяя фильтр с описаным выше подклассам получаем такой результат (листинг ~\protect\ref{lst:human-settlement9}).

\index{SPARQL!COUNT!Cписок классов, сопутствующих <<населённому пункту>> в свойстве <<экземпляр>>, без исторических объектов}
\index{SPARQL!FILTER!Cписок классов, сопутствующих <<населённому пункту>> в свойстве <<экземпляр>>, без исторических объектов}
\index{SPARQL!MINUS!Cписок классов, сопутствующих <<населённому пункту>> в свойстве <<экземпляр>>, без исторических объектов}
\lstset{numbers=left, firstnumber=1, frame=single}
\begin{lstlisting}[ language=SPARQL, 
                    caption={\href{https://w.wiki/4dTq}{Cписок классов, сопутствующих <<населённому пункту>> в свойстве <<экземпляр>>, без исторических объектов}\protect\footnotemark},
                    label=lst:human-settlement9,
                    texcl 
                    ]
# List of classes accompanying the human\_settlement in the property
# 'instance of' without historical objects 
SELECT ?inst ?instLabel (COUNT(?hum) as ?sumHum) WHERE{
  ?hum wdt:P31 wd:Q486972;    # instance of human settlement
       wdt:P31 ?inst. # other objects in instance of human settlement
  ?inst wdt:P31 ?test. # instance of ?inst
  ?test wdt:P31 ?typ. # instance of ?test
  MINUS {?inst wdt:P17 []}.   # without country
  # without human settlement and prehistoric settlements
  FILTER(?inst != wd:Q486972 && ?typ != wd:Q465299 
         && ?typ != wd:Q11514315 && ?typ != wd:Q15401699 
         && ?typ != wd:Q200325 && ?typ != wd:Q392928 ). 
  SERVICE wikibase:label{bd:serviceParam wikibase:language "ru,en"}
}
GROUP BY ?inst ?instLabel
ORDER BY DESC (?sumHum)
\end{lstlisting}%
\footnotetext{Получено 89 результатов. Ссылка на SPARQL-запрос: \href{https://w.wiki/4dTq}{https://w.wiki/4dTq}}

В итоге, вместо 707 классов из (листинг ~\protect\ref{lst:human-settlement8}), мы получили 89 различных классов, сопутствующих <<населённому пункту>> в свойстве <<экземпляр>> . 

%%%%%
\section{Отечественные учёные на селе и в городе}

Попробуем подсчитать число отечественных учёных, родившихся в сельских и городских типах населённых пунктов. И сравнить эти числа.
Решим эту задачу за пять шагов:
\begin{enumerate}
  \item Выявим список сельских и список городских типов поселений именно в России.
  \item Определим основные научные направления, представленные в Викиданных.
  \item Выявим способ определения отечественных ученых.
  \item Сделаем такую диаграмму, на которой разным цветом будут указаны разные научные направления (математики, физики, химики и так далее) для учёных родившихся в сельских поселениях.
  \item Сделаем вторую диаграмму — по городским поселениям и сравнить результаты.
\end{enumerate}

%%%%%
\subsection{Список сельских и список городских типов поселений именно в России}

Выведем список классов поселений и их количество для объектов имеющих свойство \wdProperty{1082}{численность населения} и принадлежащие государству \wdqName{России}{159} (листинг ~\protect\ref{lst:human-settlement4}). 

\index{SPARQL!COUNT!Список классов поселений и их количество для объектов имеющих свойство <<численность населения>> в России}
\begin{lstlisting}[ language=SPARQL, 
                    caption={\href{https://w.wiki/4dBU}{Список классов поселений и их количество для объектов имеющих свойство <<численность населения>> в России}\protect\footnotemark},
                    label=lst:human-settlement4,
                    texcl 
                    ]
# List of settlement classes and their number for objects with 
# the property "population" in Russia
SELECT ?class ?classLabel (COUNT(?class) AS ?count) WHERE {
  {
  SELECT ?class ?classLabel ?humLabel WHERE {
   ?hum wdt:P17 wd:Q159;  # settlement in the Russia
        wdt:P1082 ?population; # has ?population
        wdt:P31 ?class. # has ?class
    SERVICE wikibase:label{bd:serviceParam wikibase:language "ru,en"}
   }
  }
}
GROUP BY ?class ?classLabel
ORDER BY DESC (?count)
\end{lstlisting}%
\footnotetext{Получили 216 разных классов поселений. Ссылка на SPARQL-запрос: \href{https://w.wiki/4dBU}{https://w.wiki/4dBU}}

Основные классы (листинг ~\protect\ref{lst:human-settlement4}) представлены в таблице ~\ref{tab:human-settlement1}.

\begin{table}[h]
\centering
\begin{tabular}{|l|l|l|l|}
\hline
номер & название класса                       						& количество упоминаний	& Население		\\ \hline
1         & \wdqName{сельское поселение в России}{634099}     			& \num{18104}                		& \num{34043885} 		\\
2         & \wdqName{деревня}{5084}              						& \num{14795}                		& \num{1727221}       	\\
3         & \wdqName{село}{532}								& \num{9875}               		& \num{10584016} 		\\ 
4         & \wdqName{посёлок}{2514025}						& \num{4418}               		& \num{3326567} 		\\ 
7         & \wdqName{хутор}{2023000}							& \num{1733}               		& \num{509825} 		\\ 
9         & \wdqName{город}{7930989}							& \num{1171}               		& \num{104453583} 	\\ 
10       & \wdqName{населённый пункт}{486972}					& \num{1168}               		& \num{6643211} 		\\ 
11       & \wdqName{посёлок городского типа России}{15078955}		& \num{665}               		& \num{3745723} 		\\ 
21       & \wdqName{город с населением более 100 000 человек}{1549591}	& \num{108}               		& \num{58159327} 		\\ 
54       & \wdqName{город-миллионер}{1637706}					& \num{14}               		& \num{32136227} 		\\ \hline
\end{tabular}
\caption{Таблица классов и их количество упоминаний среди объектов имеющих свойство <<численность населения>> в России}
\label{tab:human-settlement1}
\end{table}

Из исследований проведенных выше мы знаем, что класс <<населённый пункт>> используется совместно с разными класами поселений. Поэтому его не будем добавлять ни к сельским, ни к городским поселениям.

Далее классы из таблицы ~\ref{tab:human-settlement1} под номерами: 1, 2, 3, 4 и 7. В дальнейшем комбинация этих классов будет упоминаться, как сельские поселения. Произведём подсчёт количества населения таких поселений в России\footnote{Получили 50 млн человек. Ссылка на SPARQL-запрос: \href{https://w.wiki/4dd7}{https://w.wiki/4dd7}}.

А классы из таблицы ~\ref{tab:human-settlement1} под номерами: 9, 11, 21 и 54. В дальнейшем комбинация этих классов будет упоминаться, как городские поселения. Произведём подсчёт количества населения таких поселений в России\footnote{Получили 198 млн человек. Ссылка на SPARQL-запрос: \href{https://w.wiki/4ddH}{https://w.wiki/4ddH}}.

%%%%%
\subsection{Основные научные направления, представленные в Викиданных}

Выведем список профессий и их количество для людей со свойством \wdProperty{27}{гражданство} \wdqName{России}{159} (листинг ~\protect\ref{lst:human-settlement13}). 

\index{SPARQL!COUNT!Список профессий или должностей граждан России}
\lstset{numbers=left, firstnumber=1, frame=single}
\begin{lstlisting}[ language=SPARQL, 
                    caption={\href{https://w.wiki/4daC}{Список профессий или должностей граждан России}\protect\footnotemark},
                    label=lst:human-settlement13,
                    texcl 
                    ]
# List of occupation or job citizens of Russia 
SELECT DISTINCT ?job ?jobLabel (COUNT(?hum) AS ?count) WHERE {
  ?hum wdt:P27 wd:Q159; # citizen of Russia 
       wdt:P106 ?job. # has occupation or job
  SERVICE wikibase:label{bd:serviceParam wikibase:language "ru,en"}
}
GROUP BY ?job ?jobLabel
ORDER BY ?count
\end{lstlisting}%
\footnotetext{Получено 89 результатов. Ссылка на SPARQL-запрос: \href{https://w.wiki/4daC}{https://w.wiki/4daC}}

Ниже приведена таблица ~\ref{tab:human-settlement3} с выбранными научными направления из (листинг ~\protect\ref{lst:human-settlement13}).

\begin{table}[h]
\centering
\begin{tabular}{|l|l|l|}
\hline
номер & название класса                       		& количество упоминаний	\\ \hline
1         & \wdqName{физик}{169470}     		& \num{991}                		\\
2         & \wdqName{историк}{201788}              	& \num{913}                		\\
3         & \wdqName{экономист}{188094}		& \num{880}               		\\ 
4         & \wdqName{математик}{170790}		& \num{857}               		\\ 
5         & \wdqName{инженер}{81096}			& \num{558}               		\\ 
6         & \wdqName{исследователь}{1650915}	& \num{502}               		\\ 
7       	& \wdqName{химик}{593644}			& \num{439}               		\\ 
8      	& \wdqName{врач}{39631}			& \num{342}               		\\ 
9     	& \wdqName{юрист}{185351}			& \num{330}               		\\ 
10       & \wdqName{биолог}{864503}			& \num{222}               		 \\ \hline
\end{tabular}
\caption{Таблица научных направлений и их количество упоминаний среди людей с Росиийским гражданством}
\label{tab:human-settlement3}
\end{table}

%%%%%
\subsection{Выявить способ определения отечественных ученых}

Есть два способа получения списка ученых. 
Первый по наличию свойства \wdProperty{512}{научная степень}. Выведем список людей имеющих такое свойство (листинг ~\protect\ref{lst:human-settlement14}). 

\index{SPARQL!COUNT!Количество людей из России с учёной степенью}
\begin{lstlisting}[ language=SPARQL, 
                    caption={\href{https://w.wiki/4deJ}{Количество людей из России с учёной степенью}\protect\footnotemark},
                    label=lst:human-settlement14,
                    texcl 
                    ]
# Count of peoples in Russian with academic degree
SELECT (COUNT(DISTINCT ?hum) AS ?human_count) WHERE {
  # Russian Empire, Soviet Union and Russia
  VALUES ?ruCountries {wd:Q34266 wd:Q15180 wd:Q159}
  ?hum wdt:P512 ?academic_degree;  # has academic degree 
       wdt:P27 ?ruCountries. # lives (lived) in Russian countries
  SERVICE wikibase:label{bd:serviceParam wikibase:language "ru,en"}
}
\end{lstlisting}%
\footnotetext{Получено 24297 человек. Ссылка на SPARQL-запрос: \href{https://w.wiki/4deJ}{https://w.wiki/4deJ}}

Второй по наличию свойства \wdProperty{463}{участник организации} нескольких академий: \wdqName{academy of sciences}{414147}, \wdqName{learned society}{955824}, \wdqName{scientific society}{74801}, \wdqName{academy}{162633}, \wdqName{research institute}{31855}, \wdqName{educational institution}{2385804 }. Выведем список людей имеющих такое свойство (листинг ~\protect\ref{lst:human-settlement15}). 

\index{SPARQL!COUNT!Количество людей из академий в России}
\begin{lstlisting}[ language=SPARQL, 
                    caption={\href{https://w.wiki/4deV}{Количество людей из академий в России}\protect\footnotemark},
                    label=lst:human-settlement15,
                    texcl 
                    ]
# Count of peoples in Russian in academy
SELECT (COUNT(DISTINCT ?hum) AS ?human_count) WHERE {
  VALUES ?ruCountries {wd:Q34266 wd:Q15180 wd:Q159}
  VALUES ?class_academy {wd:Q414147 wd:Q955824 wd:Q74801 wd:Q162633 
                      wd:Q31855 wd:Q2385804 wd:Q83172}
  ?hum wdt:P463 ?academy;  # has academic degree 
       wdt:P27 ?ruCountries. # lives (lived) in countries
  # academy is an element of the class academy
  ?academy wdt:P31 ?class_academy. 
  SERVICE wikibase:label{bd:serviceParam wikibase:language "ru,en"}
}
\end{lstlisting}%
\footnotetext{Получено 4170 человек. Ссылка на SPARQL-запрос: \href{https://w.wiki/4deV}{https://w.wiki/4deV}}

Первый способ дает больше людей, что позволить увидеть более подробную картину на диаграммах ниже. Будем его использовать для построения диаграмм ниже.

%%%%%
\subsection{Построение диаграммы на которой разным цветом будут указаны разные научные направления для учёных родившихся в сельских поселениях}

Используя вышеописанные шаги, получаем такой результат (листинг ~\protect\ref{lst:human-settlement16}).

\index{SPARQL!COUNT!Диаграмма количества ученых по родам деятельности родившихся в сельских поселениях}
\index{SPARQL!FILTER!Диаграмма количества ученых по родам деятельности родившихся в сельских поселениях}
\index{SPARQL!FLOOR!Диаграмма количества ученых по родам деятельности родившихся в сельских поселениях}
\index{SPARQL!YEAR!Диаграмма количества ученых по родам деятельности родившихся в сельских поселениях}
\index{SPARQL!STR!Диаграмма количества ученых по родам деятельности родившихся в сельских поселениях}
\index{SPARQL!BIND!Диаграмма количества ученых по родам деятельности родившихся в сельских поселениях}
\index{SPARQL!GROUP BY!Диаграмма количества ученых по родам деятельности родившихся в сельских поселениях}
\index{График!BarChart!Диаграмма количества ученых по родам деятельности родившихся в сельских поселениях}

\begin{lstlisting}[ language=SPARQL, 
                    caption={\href{https://w.wiki/xxxx}{Диаграмма количества ученых по родам деятельности родившихся в сельских поселениях}\protect\footnotemark},
                    label=lst:human-settlement16,
                    texcl 
                    ]
# defaultView:BarChart
# Diagram of the number of scientists by occupation in rural settlements

\end{lstlisting}%
\footnotetext{Ссылка на SPARQL-запрос: \href{https://w.wiki/xxxx}{https://w.wiki/xxxx}}

Диаграмма ~\ref{fig:human-settlement-5} показывает количество ученых по родам деятельности родившихся в сельских поселениях.

\begin{figure*}
    \setlength{\fboxsep}{0pt}%
    \setlength{\fboxrule}{1pt}%
    \fcolorbox{gray}{gray}{\includegraphics[width=1\linewidth]{./chapter/human_settlement/RussianScientistBornVillage.png}}
	\label{fig:human-settlement-5}
	\caption[Диаграмма количества ученых по родам деятельности родившихся в сельских поселениях.]{Диаграмма количества ученых по родам деятельности родившихся в сельских поселениях. Ссылка на SPARQL-запрос: \href{https://w.wiki/xxxx}{https://w.wiki/xxxx}.}%
\end{figure*} 

%%%%%
\subsection{Построение диаграммы для учёных родившихся в городских поселениях и сравнение диаграмм}

Используя вышеописанные шаги, получаем такой результат (листинг ~\protect\ref{lst:human-settlement17}).

\index{SPARQL!COUNT!Диаграмма количества ученых по родам деятельности родившихся в городских поселениях}
\index{SPARQL!FILTER!Диаграмма количества ученых по родам деятельности родившихся в городских поселениях}
\index{SPARQL!FLOOR!Диаграмма количества ученых по родам деятельности родившихся в городских поселениях}
\index{SPARQL!YEAR!Диаграмма количества ученых по родам деятельности родившихся в городских поселениях}
\index{SPARQL!STR!Диаграмма количества ученых по родам деятельности родившихся в городских поселениях}
\index{SPARQL!BIND!Диаграмма количества ученых по родам деятельности родившихся в городских поселениях}
\index{SPARQL!GROUP BY!Диаграмма количества ученых по родам деятельности родившихся в городских поселениях}
\index{График!BarChart!Диаграмма количества ученых по родам деятельности родившихся в городских поселениях}

\begin{lstlisting}[ language=SPARQL, 
                    caption={\href{https://w.wiki/xxxx}{Диаграмма количества ученых по родам деятельности родившихся в городских поселениях}\protect\footnotemark},
                    label=lst:human-settlement17,
                    texcl 
                    ]
# defaultView:BarChart
# Diagram of the number of scientists by occupation in town settlements

\end{lstlisting}%
\footnotetext{Ссылка на SPARQL-запрос: \href{https://w.wiki/xxxx}{https://w.wiki/xxxx}}

Диаграмма ~\ref{fig:human-settlement-6} показывает количество ученых по родам деятельности родившихся в городских полесениях.

\begin{figure*}
    \setlength{\fboxsep}{0pt}%
    \setlength{\fboxrule}{1pt}%
    \fcolorbox{gray}{gray}{\includegraphics[width=1\linewidth]{./chapter/human_settlement/RussianScientistBornTown.png}}
	\label{fig:human-settlement-6}
	\caption[Диаграмма количества ученых по родам деятельности родившихся в городских поселениях.]{Диаграмма количества ученых по родам деятельности родившихся в городских поселениях. Ссылка на SPARQL-запрос: \href{https://w.wiki/xxxx}{https://w.wiki/xxxx}}%
\end{figure*} 

Сравнив диаграммы, видно что ученных в городских поселениях больше примерно в 3 раза, чем в сельских поселениях. Выше мы считали количество населения с этих группах, разница в населении достигает почти в 4 раза. Следовательно можно сказать, что не важно где ты родился. 
